/* 八字排盘 v0.16.0 — constants.js */
(function() {

const LOC_DATA = {
  '上海市':{cities:{
    '上海市':{lng:121.47,dist:['黄浦区','徐汇区','长宁区','静安区','普陀区','虹口区','杨浦区','浦东新区','闵行区','宝山区','嘉定区','金山区','松江区','青浦区','奉贤区','崇明区']}
  }},
  '云南省':{cities:{
    '临沧市':{lng:100.09,dist:['临翔区','凤庆县','云县','永德县','镇康县','双江拉祜族佤族布朗族傣族自治县','耿马傣族佤族自治县','沧源佤族自治县']},
    '丽江市':{lng:100.23,dist:['古城区','玉龙纳西族自治县','永胜县','华坪县','宁蒗彝族自治县']},
    '保山市':{lng:99.18,dist:['隆阳区','施甸县','龙陵县','昌宁县','腾冲市']},
    '昆明市':{lng:102.71,dist:['五华区','盘龙区','官渡区','西山区','东川区','呈贡区','晋宁区','富民县','宜良县','石林彝族自治县','嵩明县','禄劝彝族苗族自治县','寻甸回族彝族自治县','安宁市']},
    '昭通市':{lng:103.72,dist:['昭阳区','鲁甸县','巧家县','盐津县','大关县','永善县','绥江县','镇雄县','彝良县','威信县','水富市']},
    '普洱市':{lng:100.97,dist:['思茅区','宁洱哈尼族彝族自治县','墨江哈尼族自治县','景东彝族自治县','景谷傣族彝族自治县','镇沅彝族哈尼族拉祜族自治县','江城哈尼族彝族自治县','孟连傣族拉祜族佤族自治县','澜沧拉祜族自治县','西盟佤族自治县']},
    '曲靖市':{lng:103.79,dist:['麒麟区','沾益区','马龙区','陆良县','师宗县','罗平县','富源县','会泽县','宣威市']},
    '玉溪市':{lng:102.55,dist:['红塔区','江川区','通海县','华宁县','易门县','峨山彝族自治县','新平彝族傣族自治县','元江哈尼族彝族傣族自治县','澄江市']}
  }},
  '内蒙古':{cities:{
    '乌兰察布市':{lng:113.12,dist:['集宁区','卓资县','化德县','商都县','兴和县','凉城县','察哈尔右翼前旗','察哈尔右翼中旗','察哈尔右翼后旗','四子王旗','丰镇市']},
    '乌海市':{lng:106.82,dist:['海勃湾区','海南区','乌达区']},
    '包头市':{lng:109.84,dist:['东河区','昆都仑区','青山区','石拐区','白云鄂博矿区','九原区','土默特右旗','固阳县','达尔罕茂明安联合旗','包头稀土高新技术产业开发区']},
    '呼伦贝尔市':{lng:119.77,dist:['海拉尔区','扎赉诺尔区','阿荣旗','莫力达瓦达斡尔族自治旗','鄂伦春自治旗','鄂温克族自治旗','陈巴尔虎旗','新巴尔虎左旗','新巴尔虎右旗','满洲里市','牙克石市','扎兰屯市','额尔古纳市','根河市']},
    '呼和浩特市':{lng:111.75,dist:['新城区','回民区','玉泉区','赛罕区','土默特左旗','托克托县','和林格尔县','清水河县','武川县','呼和浩特经济技术开发区']},
    '巴彦淖尔市':{lng:107.39,dist:['临河区','五原县','磴口县','乌拉特前旗','乌拉特中旗','乌拉特后旗','杭锦后旗']},
    '赤峰市':{lng:118.89,dist:['红山区','元宝山区','松山区','阿鲁科尔沁旗','巴林左旗','巴林右旗','林西县','克什克腾旗','翁牛特旗','喀喇沁旗','宁城县','敖汉旗']},
    '通辽市':{lng:122.26,dist:['科尔沁区','科尔沁左翼中旗','科尔沁左翼后旗','开鲁县','库伦旗','奈曼旗','扎鲁特旗','通辽经济技术开发区','霍林郭勒市']},
    '鄂尔多斯市':{lng:109.78,dist:['东胜区','康巴什区','达拉特旗','准格尔旗','鄂托克前旗','鄂托克旗','杭锦旗','乌审旗','伊金霍洛旗']}
  }},
  '北京市':{cities:{
    '北京市':{lng:116.4,dist:['东城区','西城区','朝阳区','海淀区','丰台区','石景山区','通州区','大兴区','顺义区','昌平区','房山区','门头沟区','平谷区','怀柔区','密云区','延庆区']}
  }},
  '台湾':{cities:{
    '台中市':{lng:120.68},
    '台北市':{lng:121.53},
    '台南市':{lng:120.22},
    '高雄市':{lng:120.31}
  }},
  '吉林省':{cities:{
    '吉林市':{lng:126.55,dist:['昌邑区','龙潭区','船营区','丰满区','永吉县','吉林经济开发区','吉林高新技术产业开发区','吉林中国新加坡食品区','蛟河市','桦甸市','舒兰市','磐石市']},
    '四平市':{lng:124.37,dist:['铁西区','铁东区','梨树县','伊通满族自治县','双辽市']},
    '延边州':{lng:129.51,dist:['延吉市','图们市','敦化市','珲春市','龙井市','和龙市','汪清县','安图县']},
    '松原市':{lng:124.82,dist:['宁江区','前郭尔罗斯蒙古族自治县','长岭县','乾安县','吉林松原经济开发区','扶余市']},
    '白城市':{lng:122.84,dist:['洮北区','镇赉县','通榆县','吉林白城经济开发区','洮南市','大安市']},
    '白山市':{lng:126.42,dist:['浑江区','江源区','抚松县','靖宇县','长白朝鲜族自治县','临江市']},
    '辽源市':{lng:125.14,dist:['龙山区','西安区','东丰县','东辽县']},
    '通化市':{lng:125.94,dist:['东昌区','二道江区','通化县','辉南县','柳河县','梅河口市','集安市']},
    '长春市':{lng:125.32,dist:['南关区','宽城区','朝阳区','二道区','绿园区','双阳区','九台区','农安县','长春经济技术开发区','长春净月高新技术产业开发区','长春高新技术产业开发区','长春汽车经济技术开发区','榆树市','德惠市','公主岭市']}
  }},
  '四川省':{cities:{
    '乐山市':{lng:103.77,dist:['市中区','沙湾区','五通桥区','金口河区','犍为县','井研县','夹江县','沐川县','峨边彝族自治县','马边彝族自治县','峨眉山市']},
    '内江市':{lng:105.06,dist:['市中区','东兴区','威远县','资中县','隆昌市']},
    '凉山州':{lng:102.27,dist:['西昌市','会理市','木里藏族自治县','盐源县','德昌县','会东县','宁南县','普格县','布拖县','金阳县','昭觉县','喜德县','冕宁县','越西县','甘洛县','美姑县','雷波县']},
    '南充市':{lng:106.11,dist:['顺庆区','高坪区','嘉陵区','南部县','营山县','蓬安县','仪陇县','西充县','阆中市']},
    '宜宾市':{lng:104.62,dist:['翠屏区','南溪区','叙州区','江安县','长宁县','高县','珙县','筠连县','兴文县','屏山县']},
    '巴中市':{lng:106.75,dist:['巴州区','恩阳区','通江县','南江县','平昌县']},
    '广元市':{lng:105.83,dist:['利州区','昭化区','朝天区','旺苍县','青川县','剑阁县','苍溪县']},
    '广安市':{lng:106.63,dist:['广安区','前锋区','岳池县','武胜县','邻水县','华蓥市']},
    '德阳市':{lng:104.4,dist:['旌阳区','罗江区','中江县','广汉市','什邡市','绵竹市']},
    '成都市':{lng:104.07,dist:['锦江区','青羊区','金牛区','武侯区','成华区','龙泉驿区','青白江区','新都区','温江区','双流区','郫都区','新津区','都江堰市','彭州市','邛崃市','崇州市','简阳市','金堂县','大邑县','蒲江县']},
    '攀枝花市':{lng:101.72,dist:['东区','西区','仁和区','米易县','盐边县']},
    '泸州市':{lng:105.44,dist:['江阳区','纳溪区','龙马潭区','泸县','合江县','叙永县','古蔺县']},
    '甘孜州':{lng:101.96,dist:['康定市','泸定县','丹巴县','九龙县','雅江县','道孚县','炉霍县','甘孜县','新龙县','德格县','白玉县','石渠县','色达县','理塘县','巴塘县','乡城县','稻城县','得荣县']},
    '眉山市':{lng:103.85,dist:['东坡区','彭山区','仁寿县','洪雅县','丹棱县','青神县']},
    '绵阳市':{lng:104.68,dist:['涪城区','游仙区','安州区','三台县','盐亭县','梓潼县','北川羌族自治县','平武县','江油市']},
    '自贡市':{lng:104.78,dist:['自流井区','贡井区','大安区','沿滩区','荣县','富顺县']},
    '资阳市':{lng:104.63,dist:['雁江区','安岳县','乐至县']},
    '达州市':{lng:107.47,dist:['通川区','达川区','宣汉县','开江县','大竹县','渠县','万源市']},
    '遂宁市':{lng:105.57,dist:['船山区','安居区','蓬溪县','大英县','射洪市']},
    '阿坝州':{lng:102.22,dist:['马尔康市','汶川县','理县','茂县','松潘县','九寨沟县','金川县','小金县','黑水县','壤塘县','阿坝县','若尔盖县','红原县']},
    '雅安市':{lng:103.01,dist:['雨城区','名山区','荥经县','汉源县','石棉县','天全县','芦山县','宝兴县']}
  }},
  '天津市':{cities:{
    '天津市':{lng:117.2,dist:['和平区','河东区','河西区','南开区','河北区','红桥区','滨海新区','东丽区','西青区','津南区','北辰区','武清区','宝坻区','宁河区','静海区','蓟州区']}
  }},
  '宁夏':{cities:{
    '中卫市':{lng:105.2,dist:['沙坡头区','中宁县','海原县']},
    '吴忠市':{lng:106.2,dist:['利通区','红寺堡区','盐池县','同心县','青铜峡市']},
    '固原市':{lng:106.28,dist:['原州区','西吉县','隆德县','泾源县','彭阳县']},
    '石嘴山市':{lng:106.38,dist:['大武口区','惠农区','平罗县']},
    '银川市':{lng:106.23,dist:['兴庆区','西夏区','金凤区','永宁县','贺兰县','灵武市']}
  }},
  '安徽省':{cities:{
    '亳州市':{lng:115.78,dist:['谯城区','涡阳县','蒙城县','利辛县']},
    '六安市':{lng:116.52,dist:['金安区','裕安区','叶集区','霍邱县','舒城县','金寨县','霍山县']},
    '合肥市':{lng:117.23,dist:['瑶海区','庐阳区','蜀山区','包河区','长丰县','肥东县','肥西县','庐江县','合肥高新技术产业开发区','合肥经济技术开发区','合肥新站高新技术产业开发区','巢湖市']},
    '安庆市':{lng:117.05,dist:['迎江区','大观区','宜秀区','怀宁县','太湖县','宿松县','望江县','岳西县','安徽安庆经济开发区','桐城市','潜山市']},
    '宣城市':{lng:118.76,dist:['宣州区','郎溪县','泾县','绩溪县','旌德县','宣城市经济开发区','宁国市','广德市']},
    '宿州市':{lng:116.97,dist:['埇桥区','砀山县','萧县','灵璧县','泗县','宿州马鞍山现代产业园区','宿州经济技术开发区']},
    '池州市':{lng:117.49,dist:['贵池区','东至县','石台县','青阳县']},
    '淮北市':{lng:116.8,dist:['杜集区','相山区','烈山区','濉溪县']},
    '淮南市':{lng:117.0,dist:['大通区','田家庵区','谢家集区','八公山区','潘集区','凤台县','寿县']},
    '滁州市':{lng:118.33,dist:['琅琊区','南谯区','来安县','全椒县','定远县','凤阳县','中新苏滁高新技术产业开发区','滁州经济技术开发区','天长市','明光市']},
    '芜湖市':{lng:118.43,dist:['镜湖区','鸠江区','弋江区','湾沚区','繁昌区','南陵县','芜湖经济技术开发区','安徽芜湖三山经济开发区','无为市']},
    '蚌埠市':{lng:117.39,dist:['龙子湖区','蚌山区','禹会区','淮上区','怀远县','五河县','固镇县','蚌埠市高新技术开发区','蚌埠市经济开发区']},
    '铜陵市':{lng:117.81,dist:['铜官区','义安区','郊区','枞阳县']},
    '阜阳市':{lng:115.81,dist:['颍州区','颍东区','颍泉区','临泉县','太和县','阜南县','颍上县','阜阳合肥现代产业园区','阜阳经济技术开发区','界首市']},
    '马鞍山市':{lng:118.51,dist:['花山区','雨山区','博望区','当涂县','含山县','和县']},
    '黄山市':{lng:118.34,dist:['屯溪区','黄山区','徽州区','歙县','休宁县','黟县','祁门县']}
  }},
  '山东省':{cities:{
    '东营市':{lng:118.67,dist:['东营区','河口区','垦利区','利津县','广饶县','东营经济技术开发区','东营港经济开发区']},
    '临沂市':{lng:118.35,dist:['兰山区','罗庄区','河东区','沂南县','郯城县','沂水县','兰陵县','费县','平邑县','莒南县','蒙阴县','临沭县','临沂高新技术产业开发区']},
    '威海市':{lng:122.12,dist:['环翠区','文登区','威海火炬高技术产业开发区','威海经济技术开发区','威海临港经济技术开发区','荣成市','乳山市']},
    '德州市':{lng:116.36,dist:['德城区','陵城区','宁津县','庆云县','临邑县','齐河县','平原县','夏津县','武城县','德州天衢新区','乐陵市','禹城市']},
    '日照市':{lng:119.53,dist:['东港区','岚山区','五莲县','莒县','日照经济技术开发区']},
    '枣庄市':{lng:117.32,dist:['市中区','薛城区','峄城区','台儿庄区','山亭区','滕州市']},
    '泰安市':{lng:117.09,dist:['泰山区','岱岳区','宁阳县','东平县','新泰市','肥城市']},
    '济南市':{lng:117.0,dist:['历下区','市中区','槐荫区','天桥区','历城区','长清区','章丘区','济阳区','莱芜区','钢城区','平阴县','商河县','济南高新技术产业开发区']},
    '济宁市':{lng:116.59,dist:['任城区','兖州区','微山县','鱼台县','金乡县','嘉祥县','汶上县','泗水县','梁山县','济宁高新技术产业开发区','曲阜市','邹城市']},
    '淄博市':{lng:118.05,dist:['淄川区','张店区','博山区','临淄区','周村区','桓台县','高青县','沂源县']},
    '滨州市':{lng:117.97,dist:['滨城区','沾化区','惠民县','阳信县','无棣县','博兴县','邹平市']},
    '潍坊市':{lng:119.16,dist:['潍城区','寒亭区','坊子区','奎文区','临朐县','昌乐县','潍坊滨海经济技术开发区','青州市','诸城市','寿光市','安丘市','高密市','昌邑市']},
    '烟台市':{lng:121.45,dist:['芝罘区','福山区','牟平区','莱山区','蓬莱区','烟台高新技术产业开发区','烟台经济技术开发区','龙口市','莱阳市','莱州市','招远市','栖霞市','海阳市']},
    '聊城市':{lng:115.99,dist:['东昌府区','茌平区','阳谷县','莘县','东阿县','冠县','高唐县','临清市']},
    '菏泽市':{lng:115.48,dist:['牡丹区','定陶区','曹县','单县','成武县','巨野县','郓城县','鄄城县','东明县','菏泽经济技术开发区','菏泽高新技术开发区']},
    '青岛市':{lng:120.38,dist:['市南区','市北区','黄岛区','崂山区','李沧区','城阳区','即墨区','胶州市','平度市','莱西市']}
  }},
  '山西省':{cities:{
    '临汾市':{lng:111.52,dist:['尧都区','曲沃县','翼城县','襄汾县','洪洞县','古县','安泽县','浮山县','吉县','乡宁县','大宁县','隰县','永和县','蒲县','汾西县','侯马市','霍州市']},
    '吕梁市':{lng:111.14,dist:['离石区','文水县','交城县','兴县','临县','柳林县','石楼县','岚县','方山县','中阳县','交口县','孝义市','汾阳市']},
    '大同市':{lng:113.3,dist:['新荣区','平城区','云冈区','云州区','阳高县','天镇县','广灵县','灵丘县','浑源县','左云县','山西大同经济开发区']},
    '太原市':{lng:112.55,dist:['小店区','迎泽区','杏花岭区','尖草坪区','万柏林区','晋源区','清徐县','阳曲县','娄烦县','山西转型综合改革示范区','古交市']},
    '忻州市':{lng:112.73,dist:['忻府区','定襄县','五台县','代县','繁峙县','宁武县','静乐县','神池县','五寨县','岢岚县','河曲县','保德县','偏关县','五台山风景名胜区','原平市']},
    '晋中市':{lng:112.75,dist:['榆次区','太谷区','榆社县','左权县','和顺县','昔阳县','寿阳县','祁县','平遥县','灵石县','介休市']},
    '晋城市':{lng:112.85,dist:['城区','沁水县','阳城县','陵川县','泽州县','高平市']},
    '朔州市':{lng:112.44,dist:['朔城区','平鲁区','山阴县','应县','右玉县','山西朔州经济开发区','怀仁市']},
    '运城市':{lng:111.0,dist:['盐湖区','临猗县','万荣县','闻喜县','稷山县','新绛县','绛县','垣曲县','夏县','平陆县','芮城县','永济市','河津市']},
    '长治市':{lng:113.12,dist:['潞州区','上党区','屯留区','潞城区','襄垣县','平顺县','黎城县','壶关县','长子县','武乡县','沁县','沁源县']},
    '阳泉市':{lng:113.58,dist:['城区','矿区','郊区','平定县','盂县']}
  }},
  '广东省':{cities:{
    '东莞市':{lng:113.75,dist:['东莞市']},
    '中山市':{lng:113.38,dist:['中山市']},
    '云浮市':{lng:112.04,dist:['云城区','云安区','新兴县','郁南县','罗定市']},
    '佛山市':{lng:113.12,dist:['禅城区','南海区','顺德区','三水区','高明区']},
    '广州市':{lng:113.26,dist:['荔湾区','越秀区','海珠区','天河区','白云区','黄埔区','番禺区','花都区','南沙区','从化区','增城区']},
    '惠州市':{lng:114.42,dist:['惠城区','惠阳区','博罗县','惠东县','龙门县']},
    '揭阳市':{lng:116.37,dist:['榕城区','揭东区','揭西县','惠来县','普宁市']},
    '梅州市':{lng:116.12,dist:['梅江区','梅县区','大埔县','丰顺县','五华县','平远县','蕉岭县','兴宁市']},
    '汕头市':{lng:116.68,dist:['龙湖区','金平区','濠江区','潮阳区','潮南区','澄海区','南澳县']},
    '汕尾市':{lng:115.38,dist:['城区','海丰县','陆河县','陆丰市']},
    '江门市':{lng:113.08,dist:['蓬江区','江海区','新会区','台山市','开平市','鹤山市','恩平市']},
    '河源市':{lng:114.7,dist:['源城区','紫金县','龙川县','连平县','和平县','东源县']},
    '深圳市':{lng:114.06,dist:['罗湖区','福田区','南山区','宝安区','龙岗区','盐田区','龙华区','坪山区','光明区']},
    '清远市':{lng:113.06,dist:['清城区','清新区','佛冈县','阳山县','连山壮族瑶族自治县','连南瑶族自治县','英德市','连州市']},
    '湛江市':{lng:110.36,dist:['赤坎区','霞山区','坡头区','麻章区','遂溪县','徐闻县','廉江市','雷州市','吴川市']},
    '潮州市':{lng:116.62,dist:['湘桥区','潮安区','饶平县']},
    '珠海市':{lng:113.58,dist:['香洲区','斗门区','金湾区']},
    '肇庆市':{lng:112.46,dist:['端州区','鼎湖区','高要区','广宁县','怀集县','封开县','德庆县','四会市']},
    '茂名市':{lng:110.93,dist:['茂南区','电白区','高州市','化州市','信宜市']},
    '阳江市':{lng:111.98,dist:['江城区','阳东区','阳西县','阳春市']},
    '韶关市':{lng:113.6,dist:['武江区','浈江区','曲江区','始兴县','仁化县','翁源县','乳源瑶族自治县','新丰县','乐昌市','南雄市']}
  }},
  '广西':{cities:{
    '北海市':{lng:109.12,dist:['海城区','银海区','铁山港区','合浦县']},
    '南宁市':{lng:108.37,dist:['兴宁区','青秀区','江南区','西乡塘区','良庆区','邕宁区','武鸣区','隆安县','马山县','上林县','宾阳县','横州市']},
    '崇左市':{lng:107.36,dist:['江州区','扶绥县','宁明县','龙州县','大新县','天等县','凭祥市']},
    '来宾市':{lng:109.22,dist:['兴宾区','忻城县','象州县','武宣县','金秀瑶族自治县','合山市']},
    '柳州市':{lng:109.42,dist:['城中区','鱼峰区','柳南区','柳北区','柳江区','柳城县','鹿寨县','融安县','融水苗族自治县','三江侗族自治县']},
    '桂林市':{lng:110.29,dist:['秀峰区','叠彩区','象山区','七星区','雁山区','临桂区','阳朔县','灵川县','全州县','兴安县','永福县','灌阳县','龙胜各族自治县','资源县','平乐县','恭城瑶族自治县','荔浦市']},
    '梧州市':{lng:111.28,dist:['万秀区','长洲区','龙圩区','苍梧县','藤县','蒙山县','岑溪市']},
    '河池市':{lng:108.09,dist:['金城江区','宜州区','南丹县','天峨县','凤山县','东兰县','罗城仫佬族自治县','环江毛南族自治县','巴马瑶族自治县','都安瑶族自治县','大化瑶族自治县']},
    '玉林市':{lng:110.18,dist:['玉州区','福绵区','容县','陆川县','博白县','兴业县','北流市']},
    '百色市':{lng:106.62,dist:['右江区','田阳区','田东县','德保县','那坡县','凌云县','乐业县','田林县','西林县','隆林各族自治县','靖西市','平果市']},
    '贵港市':{lng:109.6,dist:['港北区','港南区','覃塘区','平南县','桂平市']},
    '贺州市':{lng:111.57,dist:['八步区','平桂区','昭平县','钟山县','富川瑶族自治县']},
    '钦州市':{lng:108.65,dist:['钦南区','钦北区','灵山县','浦北县']},
    '防城港市':{lng:108.35,dist:['港口区','防城区','上思县','东兴市']}
  }},
  '新疆':{cities:{
    '乌鲁木齐市':{lng:87.62,dist:['天山区','沙依巴克区','新市区','水磨沟区','头屯河区','达坂城区','米东区','乌鲁木齐县']},
    '克拉玛依市':{lng:84.87,dist:['独山子区','克拉玛依区','白碱滩区','乌尔禾区']},
    '吐鲁番市':{lng:89.19,dist:['高昌区','鄯善县','托克逊县']},
    '哈密市':{lng:93.51,dist:['伊州区','巴里坤哈萨克自治县','伊吾县']}
  }},
  '江苏省':{cities:{
    '南京市':{lng:118.8,dist:['玄武区','秦淮区','建邺区','鼓楼区','浦口区','栖霞区','雨花台区','江宁区','六合区','溧水区','高淳区']},
    '南通市':{lng:120.89,dist:['通州区','崇川区','海门区','如东县','南通经济技术开发区','启东市','如皋市','海安市']},
    '宿迁市':{lng:118.28,dist:['宿城区','宿豫区','沭阳县','泗阳县','泗洪县','宿迁经济技术开发区']},
    '常州市':{lng:119.97,dist:['天宁区','钟楼区','新北区','武进区','金坛区','溧阳市']},
    '徐州市':{lng:117.18,dist:['鼓楼区','云龙区','贾汪区','泉山区','铜山区','丰县','沛县','睢宁县','徐州经济技术开发区','新沂市','邳州市']},
    '扬州市':{lng:119.41,dist:['广陵区','邗江区','江都区','宝应县','扬州经济技术开发区','仪征市','高邮市']},
    '无锡市':{lng:120.31,dist:['锡山区','惠山区','滨湖区','梁溪区','新吴区','江阴市','宜兴市']},
    '泰州市':{lng:119.92,dist:['海陵区','高港区','姜堰区','兴化市','靖江市','泰兴市']},
    '淮安市':{lng:119.02,dist:['淮安区','淮阴区','清江浦区','洪泽区','涟水县','盱眙县','金湖县','淮安经济技术开发区']},
    '盐城市':{lng:120.16,dist:['亭湖区','盐都区','大丰区','响水县','滨海县','阜宁县','射阳县','建湖县','盐城经济技术开发区','东台市']},
    '苏州市':{lng:120.59,dist:['虎丘区','吴中区','相城区','姑苏区','吴江区','苏州工业园区','常熟市','张家港市','昆山市','太仓市']},
    '连云港市':{lng:119.22,dist:['连云区','海州区','赣榆区','东海县','灌云县','灌南县','连云港经济技术开发区']},
    '镇江市':{lng:119.42,dist:['京口区','润州区','丹徒区','镇江新区','丹阳市','扬中市','句容市']}
  }},
  '江西省':{cities:{
    '上饶市':{lng:117.97,dist:['信州区','广丰区','广信区','玉山县','铅山县','横峰县','弋阳县','余干县','鄱阳县','万年县','婺源县','德兴市']},
    '九江市':{lng:116.0,dist:['濂溪区','浔阳区','柴桑区','武宁县','修水县','永修县','德安县','都昌县','湖口县','彭泽县','瑞昌市','共青城市','庐山市']},
    '南昌市':{lng:115.86,dist:['东湖区','西湖区','青云谱区','青山湖区','新建区','红谷滩区','南昌县','安义县','进贤县']},
    '吉安市':{lng:114.99,dist:['吉州区','青原区','吉安县','吉水县','峡江县','新干县','永丰县','泰和县','遂川县','万安县','安福县','永新县','井冈山市']},
    '宜春市':{lng:114.42,dist:['袁州区','奉新县','万载县','上高县','宜丰县','靖安县','铜鼓县','丰城市','樟树市','高安市']},
    '抚州市':{lng:116.36,dist:['临川区','东乡区','南城县','黎川县','南丰县','崇仁县','乐安县','宜黄县','金溪县','资溪县','广昌县']},
    '新余市':{lng:114.92,dist:['渝水区','分宜县']},
    '景德镇市':{lng:117.18,dist:['昌江区','珠山区','浮梁县','乐平市']},
    '萍乡市':{lng:113.85,dist:['安源区','湘东区','莲花县','上栗县','芦溪县']},
    '赣州市':{lng:114.93,dist:['章贡区','南康区','赣县区','信丰县','大余县','上犹县','崇义县','安远县','定南县','全南县','宁都县','于都县','兴国县','会昌县','寻乌县','石城县','瑞金市','龙南市']},
    '鹰潭市':{lng:117.07,dist:['月湖区','余江区','贵溪市']}
  }},
  '河北省':{cities:{
    '保定市':{lng:115.47,dist:['竞秀区','莲池区','满城区','清苑区','徐水区','涞水县','阜平县','定兴县','唐县','高阳县','容城县','涞源县','望都县','安新县','易县','曲阳县','蠡县','顺平县','博野县','雄县','保定高新技术产业开发区','保定白沟新城','涿州市','定州市','安国市','高碑店市']},
    '唐山市':{lng:118.18,dist:['路南区','路北区','古冶区','开平区','丰南区','丰润区','曹妃甸区','滦南县','乐亭县','迁西县','玉田县','河北唐山芦台经济开发区','唐山市汉沽管理区','唐山高新技术产业开发区','河北唐山海港经济开发区','遵化市','迁安市','滦州市']},
    '廊坊市':{lng:116.68,dist:['安次区','广阳区','固安县','永清县','香河县','大城县','文安县','大厂回族自治县','廊坊经济技术开发区','霸州市','三河市']},
    '张家口市':{lng:114.89,dist:['桥东区','桥西区','宣化区','下花园区','万全区','崇礼区','张北县','康保县','沽源县','尚义县','蔚县','阳原县','怀安县','怀来县','涿鹿县','赤城县','张家口经济开发区','张家口市察北管理区','张家口市塞北管理区']},
    '承德市':{lng:117.93,dist:['双桥区','双滦区','鹰手营子矿区','承德县','兴隆县','滦平县','隆化县','丰宁满族自治县','宽城满族自治县','围场满族蒙古族自治县','承德高新技术产业开发区','平泉市']},
    '沧州市':{lng:116.84,dist:['新华区','运河区','沧县','青县','东光县','海兴县','盐山县','肃宁县','南皮县','吴桥县','献县','孟村回族自治县','河北沧州经济开发区','沧州高新技术产业开发区','沧州渤海新区','泊头市','任丘市','黄骅市','河间市']},
    '石家庄市':{lng:114.51,dist:['长安区','桥西区','新华区','裕华区']},
    '秦皇岛市':{lng:119.6,dist:['海港区','山海关区','北戴河区','抚宁区','青龙满族自治县','昌黎县','卢龙县','秦皇岛市经济技术开发区','北戴河新区']},
    '衡水市':{lng:115.67,dist:['桃城区','冀州区','枣强县','武邑县','武强县','饶阳县','安平县','故城县','景县','阜城县','河北衡水高新技术产业开发区','衡水滨湖新区','深州市']},
    '邢台市':{lng:114.5,dist:['襄都区','信都区','任泽区','南和区','临城县','内丘县','柏乡县','隆尧县','宁晋县','巨鹿县','新河县','广宗县','平乡县','威县','清河县','临西县','河北邢台经济开发区','南宫市','沙河市']},
    '邯郸市':{lng:114.54,dist:['邯山区','丛台区','复兴区','峰峰矿区','肥乡区','永年区','临漳县','成安县','大名县','涉县','磁县','邱县','鸡泽县','广平县','馆陶县','魏县','曲周县','邯郸经济技术开发区','邯郸冀南新区','武安市']}
  }},
  '河南省':{cities:{
    '三门峡市':{lng:111.2,dist:['湖滨区','陕州区','渑池县','卢氏县','河南三门峡经济开发区','义马市','灵宝市']},
    '信阳市':{lng:114.08,dist:['浉河区','平桥区','罗山县','光山县','新县','商城县','固始县','潢川县','淮滨县','息县','信阳高新技术产业开发区']},
    '南阳市':{lng:112.53,dist:['宛城区','卧龙区','南召县','方城县','西峡县','镇平县','内乡县','淅川县','社旗县','唐河县','新野县','桐柏县','南阳高新技术产业开发区','南阳市城乡一体化示范区','邓州市']},
    '周口市':{lng:114.65,dist:['川汇区','淮阳区','扶沟县','西华县','商水县','沈丘县','郸城县','太康县','鹿邑县','周口临港开发区','项城市']},
    '商丘市':{lng:115.66,dist:['梁园区','睢阳区','民权县','睢县','宁陵县','柘城县','虞城县','夏邑县','豫东综合物流产业聚集区','河南商丘经济开发区','永城市']},
    '安阳市':{lng:114.39,dist:['文峰区','北关区','殷都区','龙安区','安阳县','汤阴县','滑县','内黄县','安阳高新技术产业开发区','林州市']},
    '平顶山市':{lng:113.19,dist:['新华区','卫东区','石龙区','湛河区','宝丰县','叶县','鲁山县','郏县','平顶山高新技术产业开发区','平顶山市城乡一体化示范区','舞钢市','汝州市']},
    '开封市':{lng:114.31,dist:['龙亭区','顺河回族区','鼓楼区','禹王台区','祥符区','杞县','通许县','尉氏县','兰考县']},
    '新乡市':{lng:113.93,dist:['红旗区','卫滨区','凤泉区','牧野区','新乡县','获嘉县','原阳县','延津县','封丘县','新乡高新技术产业开发区','新乡经济技术开发区','新乡市平原城乡一体化示范区','卫辉市','辉县市','长垣市']},
    '洛阳市':{lng:112.45,dist:['老城区','西工区','瀍河回族区','涧西区','偃师区','孟津区','洛龙区','新安县','栾川县','嵩县','汝阳县','宜阳县','洛宁县','伊川县','洛阳高新技术产业开发区']},
    '漯河市':{lng:114.02,dist:['源汇区','郾城区','召陵区','舞阳县','临颍县','漯河经济技术开发区']},
    '濮阳市':{lng:115.03,dist:['华龙区','清丰县','南乐县','范县','台前县','濮阳县','河南濮阳工业园区','濮阳经济技术开发区']},
    '焦作市':{lng:113.24,dist:['解放区','中站区','马村区','山阳区','修武县','博爱县','武陟县','温县','焦作城乡一体化示范区','沁阳市','孟州市']},
    '许昌市':{lng:113.85,dist:['魏都区','建安区','鄢陵县','襄城县','许昌经济技术开发区','禹州市','长葛市']},
    '郑州市':{lng:113.65,dist:['中原区','二七区','管城回族区','金水区','上街区','惠济区','中牟县','郑州经济技术开发区','郑州高新技术产业开发区','郑州航空港经济综合实验区','巩义市','荥阳市','新密市','新郑市','登封市']},
    '驻马店市':{lng:114.02,dist:['驿城区','西平县','上蔡县','平舆县','正阳县','确山县','泌阳县','汝南县','遂平县','新蔡县','河南驻马店经济开发区']},
    '鹤壁市':{lng:114.3,dist:['鹤山区','山城区','淇滨区','浚县','淇县','鹤壁经济技术开发区']}
  }},
  '浙江省':{cities:{
    '丽水市':{lng:119.92,dist:['莲都区','青田县','缙云县','遂昌县','松阳县','云和县','庆元县','景宁畲族自治县','龙泉市']},
    '台州市':{lng:121.42,dist:['椒江区','黄岩区','路桥区','三门县','天台县','仙居县','温岭市','临海市','玉环市']},
    '嘉兴市':{lng:120.76,dist:['南湖区','秀洲区','嘉善县','海盐县','海宁市','平湖市','桐乡市']},
    '宁波市':{lng:121.54,dist:['海曙区','江北区','北仑区','镇海区','鄞州区','奉化区','象山县','宁海县','余姚市','慈溪市']},
    '杭州市':{lng:120.21,dist:['上城区','拱墅区','西湖区','滨江区','萧山区','余杭区','富阳区','临安区','临平区','钱塘区','桐庐县','淳安县','建德市']},
    '温州市':{lng:120.7,dist:['鹿城区','龙湾区','瓯海区','洞头区','永嘉县','平阳县','苍南县','文成县','泰顺县','瑞安市','乐清市','龙港市']},
    '湖州市':{lng:120.09,dist:['吴兴区','南浔区','德清县','长兴县','安吉县']},
    '绍兴市':{lng:120.58,dist:['越城区','柯桥区','上虞区','新昌县','诸暨市','嵊州市']},
    '舟山市':{lng:122.21,dist:['定海区','普陀区','岱山县','嵊泗县']},
    '衢州市':{lng:118.87,dist:['柯城区','衢江区','常山县','开化县','龙游县','江山市']},
    '金华市':{lng:119.65,dist:['婺城区','金东区','武义县','浦江县','磐安县','兰溪市','义乌市','东阳市','永康市']}
  }},
  '海南省':{cities:{
    '三亚市':{lng:109.51,dist:['海棠区','吉阳区','天涯区','崖州区']},
    '三沙市':{lng:112.34,dist:['西沙群岛','南沙群岛','中沙群岛的岛礁及其海域']},
    '儋州市':{lng:109.58,dist:['儋州市']},
    '海口市':{lng:110.32,dist:['秀英区','龙华区','琼山区','美兰区']}
  }},
  '湖北省':{cities:{
    '十堰市':{lng:110.8,dist:['茅箭区','张湾区','郧阳区','郧西县','竹山县','竹溪县','房县','丹江口市']},
    '咸宁市':{lng:114.33,dist:['咸安区','嘉鱼县','通城县','崇阳县','通山县','赤壁市']},
    '孝感市':{lng:113.93,dist:['孝南区','孝昌县','大悟县','云梦县','应城市','安陆市','汉川市']},
    '宜昌市':{lng:111.29,dist:['西陵区','伍家岗区','点军区','猇亭区','夷陵区','远安县','兴山县','秭归县','长阳土家族自治县','五峰土家族自治县','宜都市','当阳市','枝江市']},
    '恩施州':{lng:109.49,dist:['恩施市','利川市','建始县','巴东县','宣恩县','咸丰县','来凤县','鹤峰县']},
    '武汉市':{lng:114.3,dist:['江岸区','江汉区','硚口区','汉阳区','武昌区','青山区','洪山区','东西湖区','汉南区','蔡甸区','江夏区','黄陂区','新洲区']},
    '荆州市':{lng:112.24,dist:['沙市区','荆州区','公安县','江陵县','荆州经济技术开发区','石首市','洪湖市','松滋市','监利市']},
    '荆门市':{lng:112.2,dist:['东宝区','掇刀区','沙洋县','钟祥市','京山市']},
    '襄阳市':{lng:112.14,dist:['襄城区','樊城区','襄州区','南漳县','谷城县','保康县','老河口市','枣阳市','宜城市']},
    '鄂州市':{lng:114.89,dist:['梁子湖区','华容区','鄂城区']},
    '随州市':{lng:113.38,dist:['曾都区','随县','广水市']},
    '黄冈市':{lng:114.88,dist:['黄州区','团风县','红安县','罗田县','英山县','浠水县','蕲春县','黄梅县','龙感湖管理区','麻城市','武穴市']},
    '黄石市':{lng:115.04,dist:['黄石港区','西塞山区','下陆区','铁山区','阳新县','大冶市']}
  }},
  '湖南省':{cities:{
    '娄底市':{lng:112.0,dist:['娄星区','双峰县','新化县','冷水江市','涟源市']},
    '岳阳市':{lng:113.13,dist:['岳阳楼区','云溪区','君山区','岳阳县','华容县','湘阴县','平江县','岳阳市屈原管理区','汨罗市','临湘市']},
    '常德市':{lng:111.7,dist:['武陵区','鼎城区','安乡县','汉寿县','澧县','临澧县','桃源县','石门县','常德市西洞庭管理区','津市市']},
    '张家界市':{lng:110.48,dist:['永定区','武陵源区','慈利县','桑植县']},
    '怀化市':{lng:109.99,dist:['鹤城区','中方县','沅陵县','辰溪县','溆浦县','会同县','麻阳苗族自治县','新晃侗族自治县','芷江侗族自治县','靖州苗族侗族自治县','通道侗族自治县','怀化市洪江管理区','洪江市']},
    '株洲市':{lng:113.13,dist:['荷塘区','芦淞区','石峰区','天元区','渌口区','攸县','茶陵县','炎陵县','醴陵市']},
    '永州市':{lng:111.61,dist:['零陵区','冷水滩区','东安县','双牌县','道县','江永县','宁远县','蓝山县','新田县','江华瑶族自治县','永州经济技术开发区','永州市回龙圩管理区','祁阳市']},
    '湘潭市':{lng:112.94,dist:['雨湖区','岳塘区','湘潭县','湖南湘潭高新技术产业园区','湘潭昭山示范区','湘潭九华示范区','湘乡市','韶山市']},
    '湘西州':{lng:109.74,dist:['吉首市','泸溪县','凤凰县','花垣县','保靖县','古丈县','永顺县','龙山县']},
    '益阳市':{lng:112.33,dist:['资阳区','赫山区','南县','桃江县','安化县','益阳市大通湖管理区','湖南益阳高新技术产业园区','沅江市']},
    '衡阳市':{lng:112.57,dist:['珠晖区','雁峰区','石鼓区','蒸湘区','南岳区','衡阳县','衡南县','衡山县','衡东县','祁东县','湖南衡阳松木经济开发区','湖南衡阳高新技术产业园区','耒阳市','常宁市']},
    '邵阳市':{lng:111.47,dist:['双清区','大祥区','北塔区','新邵县','邵阳县','隆回县','洞口县','绥宁县','新宁县','城步苗族自治县','武冈市','邵东市']},
    '郴州市':{lng:113.01,dist:['北湖区','苏仙区','桂阳县','宜章县','永兴县','嘉禾县','临武县','汝城县','桂东县','安仁县','资兴市']},
    '长沙市':{lng:112.97,dist:['芙蓉区','天心区','岳麓区','开福区','雨花区','望城区','长沙县','浏阳市','宁乡市']}
  }},
  '澳门':{cities:{
    '澳门':{lng:113.55}
  }},
  '甘肃省':{cities:{
    '兰州市':{lng:103.83,dist:['城关区','七里河区','西固区','安宁区','红古区','永登县','皋兰县','榆中县','兰州新区']},
    '嘉峪关市':{lng:98.29,dist:['嘉峪关市']},
    '天水市':{lng:105.72,dist:['秦州区','麦积区','清水县','秦安县','甘谷县','武山县','张家川回族自治县']},
    '定西市':{lng:104.63,dist:['安定区','通渭县','陇西县','渭源县','临洮县','漳县','岷县']},
    '平凉市':{lng:106.67,dist:['崆峒区','泾川县','灵台县','崇信县','庄浪县','静宁县','华亭市']},
    '庆阳市':{lng:107.64,dist:['西峰区','庆城县','环县','华池县','合水县','正宁县','宁县','镇原县']},
    '张掖市':{lng:100.45,dist:['甘州区','肃南裕固族自治县','民乐县','临泽县','高台县','山丹县']},
    '武威市':{lng:102.64,dist:['凉州区','民勤县','古浪县','天祝藏族自治县']},
    '白银市':{lng:104.14,dist:['白银区','平川区','靖远县','会宁县','景泰县']},
    '酒泉市':{lng:98.52,dist:['肃州区','金塔县','瓜州县','肃北蒙古族自治县','阿克塞哈萨克族自治县','玉门市','敦煌市']},
    '金昌市':{lng:102.19,dist:['金川区','永昌县']},
    '陇南市':{lng:104.93,dist:['武都区','成县','文县','宕昌县','康县','西和县','礼县','徽县','两当县']}
  }},
  '福建省':{cities:{
    '三明市':{lng:117.64,dist:['三元区','沙县区','明溪县','清流县','宁化县','大田县','尤溪县','将乐县','泰宁县','建宁县','永安市']},
    '南平市':{lng:118.18,dist:['延平区','建阳区','顺昌县','浦城县','光泽县','松溪县','政和县','邵武市','武夷山市','建瓯市']},
    '厦门市':{lng:118.09,dist:['思明区','海沧区','湖里区','集美区','同安区','翔安区']},
    '宁德市':{lng:119.55,dist:['蕉城区','霞浦县','古田县','屏南县','寿宁县','周宁县','柘荣县','福安市','福鼎市']},
    '泉州市':{lng:118.59,dist:['鲤城区','丰泽区','洛江区','泉港区','惠安县','安溪县','永春县','德化县','金门县','石狮市','晋江市','南安市']},
    '漳州市':{lng:117.65,dist:['芗城区','龙文区','龙海区','长泰区','云霄县','漳浦县','诏安县','东山县','南靖县','平和县','华安县']},
    '福州市':{lng:119.3,dist:['鼓楼区','台江区','仓山区','马尾区','晋安区','长乐区','闽侯县','连江县','罗源县','闽清县','永泰县','平潭县','福清市']},
    '莆田市':{lng:119.01,dist:['城厢区','涵江区','荔城区','秀屿区','仙游县']},
    '龙岩市':{lng:117.02,dist:['新罗区','永定区','长汀县','上杭县','武平县','连城县','漳平市']}
  }},
  '西藏':{cities:{
    '山南市':{lng:91.77,dist:['乃东区','扎囊县','贡嘎县','桑日县','琼结县','曲松县','措美县','洛扎县','加查县','隆子县','浪卡子县','错那市']},
    '拉萨市':{lng:91.11,dist:['城关区','堆龙德庆区','达孜区','林周县','当雄县','尼木县','曲水县','墨竹工卡县','格尔木藏青工业园区','拉萨经济技术开发区','西藏文化旅游创意园区','达孜工业园区']},
    '日喀则市':{lng:88.88,dist:['桑珠孜区','南木林县','江孜县','定日县','萨迦县','拉孜县','昂仁县','谢通门县','白朗县','仁布县','康马县','定结县','仲巴县','亚东县','吉隆县','聂拉木县','萨嘎县','岗巴县']},
    '昌都市':{lng:97.18,dist:['卡若区','江达县','贡觉县','类乌齐县','丁青县','察雅县','八宿县','左贡县','芒康县','洛隆县','边坝县']},
    '林芝市':{lng:94.36,dist:['巴宜区','工布江达县','墨脱县','波密县','察隅县','朗县','米林市']},
    '那曲市':{lng:92.06,dist:['色尼区','嘉黎县','比如县','聂荣县','安多县','申扎县','索县','班戈县','巴青县','尼玛县','双湖县']}
  }},
  '贵州省':{cities:{
    '六盘水市':{lng:104.83,dist:['钟山区','六枝特区','水城区','盘州市']},
    '安顺市':{lng:105.95,dist:['西秀区','平坝区','普定县','镇宁布依族苗族自治县','关岭布依族苗族自治县','紫云苗族布依族自治县']},
    '毕节市':{lng:105.29,dist:['七星关区','大方县','金沙县','织金县','纳雍县','威宁彝族回族苗族自治县','赫章县','黔西市']},
    '贵阳市':{lng:106.63,dist:['南明区','云岩区','花溪区','乌当区','白云区','观山湖区','开阳县','息烽县','修文县','清镇市']},
    '遵义市':{lng:106.93,dist:['红花岗区','汇川区','播州区','桐梓县','绥阳县','正安县','道真仡佬族苗族自治县','务川仡佬族苗族自治县','凤冈县','湄潭县','余庆县','习水县','赤水市','仁怀市']},
    '铜仁市':{lng:109.19,dist:['碧江区','万山区','江口县','玉屏侗族自治县','石阡县','思南县','印江土家族苗族自治县','德江县','沿河土家族自治县','松桃苗族自治县']}
  }},
  '辽宁省':{cities:{
    '丹东市':{lng:124.4,dist:['元宝区','振兴区','振安区','宽甸满族自治县','东港市','凤城市']},
    '大连市':{lng:121.62,dist:['中山区','西岗区','沙河口区','甘井子区','旅顺口区','金州区','普兰店区','长海县','瓦房店市','庄河市']},
    '抚顺市':{lng:123.96,dist:['新抚区','东洲区','望花区','顺城区','抚顺县','新宾满族自治县','清原满族自治县']},
    '朝阳市':{lng:120.45,dist:['双塔区','龙城区','朝阳县','建平县','喀喇沁左翼蒙古族自治县','北票市','凌源市']},
    '本溪市':{lng:123.77,dist:['平山区','溪湖区','明山区','南芬区','本溪满族自治县','桓仁满族自治县']},
    '沈阳市':{lng:123.43,dist:['和平区','沈河区','大东区','皇姑区','铁西区','苏家屯区','浑南区','沈北新区','于洪区','辽中区','康平县','法库县','新民市']},
    '盘锦市':{lng:122.07,dist:['双台子区','兴隆台区','大洼区','盘山县']},
    '营口市':{lng:122.23,dist:['站前区','西市区','鲅鱼圈区','老边区','盖州市','大石桥市']},
    '葫芦岛市':{lng:120.84,dist:['连山区','龙港区','南票区','绥中县','建昌县','兴城市']},
    '辽阳市':{lng:123.17,dist:['白塔区','文圣区','宏伟区','弓长岭区','太子河区','辽阳县','灯塔市']},
    '铁岭市':{lng:123.73,dist:['银州区','清河区','铁岭县','西丰县','昌图县','调兵山市','开原市']},
    '锦州市':{lng:121.13,dist:['古塔区','凌河区','太和区','黑山县','义县','凌海市','北镇市']},
    '阜新市':{lng:121.67,dist:['海州区','新邱区','太平区','清河门区','细河区','阜新蒙古族自治县','彰武县']},
    '鞍山市':{lng:122.99,dist:['铁东区','铁西区','立山区','千山区','台安县','岫岩满族自治县','海城市']}
  }},
  '重庆市':{cities:{
    '重庆市':{lng:106.55,dist:['渝中区','江北区','南岸区','沙坪坝区','九龙坡区','大渡口区','北碚区','渝北区','巴南区','涪陵区','万州区','黔江区','长寿区','江津区','合川区','永川区']}
  }},
  '陕西省':{cities:{
    '咸阳市':{lng:108.71,dist:['秦都区','杨陵区','渭城区','三原县','泾阳县','乾县','礼泉县','永寿县','长武县','旬邑县','淳化县','武功县','兴平市','彬州市']},
    '商洛市':{lng:109.94,dist:['商州区','洛南县','丹凤县','商南县','山阳县','镇安县','柞水县']},
    '安康市':{lng:109.03,dist:['汉滨区','汉阴县','石泉县','宁陕县','紫阳县','岚皋县','平利县','镇坪县','白河县','旬阳市']},
    '宝鸡市':{lng:107.24,dist:['渭滨区','金台区','陈仓区','凤翔区','岐山县','扶风县','眉县','陇县','千阳县','麟游县','凤县','太白县']},
    '延安市':{lng:109.49,dist:['宝塔区','安塞区','延长县','延川县','志丹县','吴起县','甘泉县','富县','洛川县','宜川县','黄龙县','黄陵县','子长市']},
    '榆林市':{lng:109.73,dist:['榆阳区','横山区','府谷县','靖边县','定边县','绥德县','米脂县','佳县','吴堡县','清涧县','子洲县','神木市']},
    '汉中市':{lng:107.02,dist:['汉台区','南郑区','城固县','洋县','西乡县','勉县','宁强县','略阳县','镇巴县','留坝县','佛坪县']},
    '渭南市':{lng:109.5,dist:['临渭区','华州区','潼关县','大荔县','合阳县','澄城县','蒲城县','白水县','富平县','韩城市','华阴市']},
    '西安市':{lng:108.94,dist:['新城区','碑林区','莲湖区','灞桥区','未央区','雁塔区','阎良区','临潼区','长安区','高陵区','鄠邑区','蓝田县','周至县']},
    '铜川市':{lng:109.11,dist:['王益区','印台区','耀州区','宜君县']}
  }},
  '青海省':{cities:{
    '海东市':{lng:102.1,dist:['乐都区','平安区','民和回族土族自治县','互助土族自治县','化隆回族自治县','循化撒拉族自治县']},
    '西宁市':{lng:101.78,dist:['城东区','城中区','城西区','城北区','湟中区','大通回族土族自治县','湟源县']}
  }},
  '香港':{cities:{
    '香港':{lng:114.17}
  }},
  '黑龙江省':{cities:{
    '七台河市':{lng:131.0,dist:['新兴区','桃山区','茄子河区','勃利县']},
    '伊春市':{lng:128.84,dist:['伊美区','乌翠区','友好区','嘉荫县','汤旺县','丰林县','大箐山县','南岔县','金林区','铁力市']},
    '佳木斯市':{lng:130.32,dist:['向阳区','前进区','东风区','郊区','桦南县','桦川县','汤原县','同江市','富锦市','抚远市']},
    '双鸭山市':{lng:131.16,dist:['尖山区','岭东区','四方台区','宝山区','集贤县','友谊县','宝清县','饶河县']},
    '哈尔滨市':{lng:126.64,dist:['道里区','南岗区','道外区','平房区','松北区','香坊区','呼兰区','阿城区','双城区','依兰县','方正县','宾县','巴彦县','木兰县','通河县','延寿县','尚志市','五常市']},
    '大庆市':{lng:125.03,dist:['萨尔图区','龙凤区','让胡路区','红岗区','大同区','肇州县','肇源县','林甸县','杜尔伯特蒙古族自治县','大庆高新技术产业开发区']},
    '牡丹江市':{lng:129.63,dist:['东安区','阳明区','爱民区','西安区','林口县','绥芬河市','海林市','宁安市','穆棱市','东宁市']},
    '绥化市':{lng:126.97,dist:['北林区','望奎县','兰西县','青冈县','庆安县','明水县','绥棱县','安达市','肇东市','海伦市']},
    '鸡西市':{lng:130.97,dist:['鸡冠区','恒山区','滴道区','梨树区','城子河区','麻山区','鸡东县','虎林市','密山市']},
    '鹤岗市':{lng:130.3,dist:['向阳区','工农区','南山区','兴安区','东山区','兴山区','萝北县','绥滨县']},
    '黑河市':{lng:127.49,dist:['爱辉区','逊克县','孙吴县','北安市','五大连池市','嫩江市']},
    '齐齐哈尔市':{lng:123.92,dist:['龙沙区','建华区','铁锋区','昂昂溪区','富拉尔基区','碾子山区','梅里斯达斡尔族区','龙江县','依安县','泰来县','甘南县','富裕县','克山县','克东县','拜泉县','讷河市']}
  }},
};


// 初始化省份下拉
const TG = ['甲','乙','丙','丁','戊','己','庚','辛','壬','癸'];
const DZ = ['子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥'];
const WU_XING = { '甲':'木','乙':'木','丙':'火','丁':'火','戊':'土','己':'土','庚':'金','辛':'金','壬':'水','癸':'水',
  '子':'水','丑':'土','寅':'木','卯':'木','辰':'土','巳':'火','午':'火','未':'土','申':'金','酉':'金','戌':'土','亥':'水' };
const WX_CSS = { '木':'wood','火':'fire','土':'earth','金':'metal','水':'water' };

// ===== v0.7.1 宫位映射表 =====
// 14种宫位 × 7柱，索引顺序：[胎元, 年柱, 月柱, 日柱, 命宫, 时柱, 身宫]
const GONGWEI_MAP = {
  '信息':  ['状态门控','信息输入','信息处理','意义判定','情绪标记','输出组织','执行反馈'],
  '认知':  ['生理状态','感知输入','思考加工','认知决策','趋避决策','表达输出','行动输出'],
  '功能':  ['睡眠功能','观察功能','思考功能','记忆功能','情志功能','表达功能','动作功能'],
  '做功':  ['资源位','市场位','平台位','主体位','意愿位','能力位','执行位'],
  '亲缘':  ['母亲宫位','爷辈宫位','父亲宫位','伴侣宫位','心亲宫位','子女宫位','兄弟宫位'],
  '兴趣':  ['健康兴趣','表演兴趣','研究兴趣','主导兴趣','心理兴趣','输出兴趣','身体兴趣'],
  '场景':  ['支持场景','观摩场景','共事场景','决策场景','趋避场景','表达场景','执行场景'],
  '人设':  ['贵人人设','公众人设','职场人设','主体人设','同道人设','生活人设','搭档人设'],
  '客户':  ['贵人客户','陌生客户','在谈客户','复购客户','铁粉客户','成交客户','陪跑客户'],
  '系统':  ['支持系统','远端系统','上位系统','主体系统','趋避系统','下位系统','执行系统'],
  '关系':  ['贵人宫位','陌人宫位','同事宫位','盟友宫位','同道宫位','朋友宫位','搭档宫位'],
  '圈层':  ['原生供养圈','外部公共圈','组织共事圈','亲密核心圈','喜恶偏好圈','朋友生活圈','身体实践圈'],
  '生理':  ['底层生理','感官输入','认知加工','记忆决策','情志喜恶','语言输出','身体执行'],
  '记忆':  ['记忆生理','感觉记忆','工作记忆','长时记忆','情绪记忆','记忆提取','程序记忆']
};
// data-gw → 数组索引查找
const GW_INDEX = { tai: 0, nian: 1, yue: 2, ri: 3, ming: 4, shi: 5, shen: 6 };

// ===== v0.10.0 宫位多选颜色映射 =====
const GONGWEI_COLORS = {
  '信息': '#4a6fa5', '认知': '#3d7a5c', '功能': '#a0522d',
  '做功': '#c8782a', '亲缘': '#b0486a', '兴趣': '#b8962a',
  '场景': '#4a80a0', '人设': '#7a4a8a', '客户': '#c07030',
  '系统': '#6a7a8a', '关系': '#c05858', '圈层': '#6a7a3a',
  '生理': '#b04040', '记忆': '#3a6a8a'
};
const GONGWEI_COLOR_KEYS = {
  '信息': 'info', '认知': 'cognition', '功能': 'function',
  '做功': 'zuogong', '亲缘': 'qinyuan', '兴趣': 'interest',
  '场景': 'scene', '人设': 'persona', '客户': 'client',
  '系统': 'system', '关系': 'relation', '圈层': 'circle',
  '生理': 'physio', '记忆': 'memory'
};

// ===== v0.13.0 宫位自定义 — 数据层 =====
// ===== v0.8.0 农历数据表（1900-2100，寿星万年历）=====
const LUNAR_INFO = [
  // 1900-1909
  0x0bd28, 0x07520, 0x0ea50, 0x0b2a5, 0x064b0, 0x0a9b0, 0x10aa64, 0x056a0, 0x0b590, 0x0baa2,
  // 1910-1919
  0x07520, 0x0da56, 0x0b250, 0x0a4b0, 0x10a4b5, 0x02ad0, 0x056b0, 0x05b52, 0x0da90, 0x10e927,
  // 1920-1929
  0x0e920, 0x0d250, 0x0d2d5, 0x0a560, 0x02b60, 0x10ad54, 0x06d40, 0x0ea90, 0x0f4a2, 0x0e920,
  // 1930-1939
  0x06a66, 0x052b0, 0x0a570, 0x109565, 0x0b5a0, 0x06d40, 0x107613, 0x07490, 0x10b137, 0x0a930,
  // 1940-1949
  0x052b0, 0x1051b6, 0x0aad0, 0x056a0, 0x10da54, 0x0ba40, 0x0b490, 0x0d4b2, 0x0a950, 0x0aad7,
  // 1950-1959
  0x05360, 0x0aad0, 0x10aca5, 0x05b20, 0x0da50, 0x10ea23, 0x0d4a0, 0x05958, 0x0a970, 0x05560,
  // 1960-1969
  0x05756, 0x0ad50, 0x06d20, 0x07554, 0x0ea50, 0x064a0, 0x064f3, 0x0a9b0, 0x0ada7, 0x056a0,
  // 1970-1979
  0x0b690, 0x0bb25, 0x0b520, 0x0b250, 0x0b2b4, 0x0a4b0, 0x0aab8, 0x02ad0, 0x056d0, 0x105a96,
  // 1980-1989
  0x0da90, 0x0d920, 0x0e954, 0x0d250, 0x0e4da, 0x0a560, 0x02b60, 0x02f56, 0x06d50, 0x0ea90,
  // 1990-1999
  0x0f525, 0x0e920, 0x0d260, 0x052e3, 0x0a570, 0x0ad68, 0x035a0, 0x06d50, 0x0b695, 0x07490,
  // 2000-2009
  0x06930, 0x0a9b4, 0x052b0, 0x0a5b0, 0x0aae2, 0x056a0, 0x0dd57, 0x0ba40, 0x0b490, 0x0d535,
  // 2010-2019
  0x0a950, 0x052d0, 0x055d4, 0x0ab50, 0x0baa9, 0x05d20, 0x0da50, 0x10e8a6, 0x0d4a0, 0x0c950,
  // 2020-2029
  0x0a9e4, 0x05560, 0x0ab50, 0x0ada2, 0x06d20, 0x07656, 0x07250, 0x064b0, 0x06575, 0x0cab0,
  // 2030-2039
  0x055a0, 0x056e3, 0x0b690, 0x0f52b, 0x0b520, 0x0b250, 0x10d0b6, 0x0a4b0, 0x04ab0, 0x02bb5,
  // 2040-2049
  0x05ad0, 0x0b6a0, 0x0daa2, 0x0d920, 0x0ea57, 0x0d250, 0x0a550, 0x10a4d5, 0x04b60, 0x05b50,
  // 2050-2059
  0x106d23, 0x0ec90, 0x0f928, 0x0e920, 0x0d260, 0x105166, 0x0a570, 0x05560, 0x103654, 0x07550,
  // 2060-2069
  0x07490, 0x074b3, 0x06930, 0x0aab7, 0x052b0, 0x0a5b0, 0x0aba5, 0x056a0, 0x0b650, 0x0baa4,
  // 2070-2079
  0x0b4a0, 0x0d958, 0x0a950, 0x052d0, 0x056d6, 0x0ab50, 0x05aa0, 0x05d54, 0x0da50, 0x0d4a0,
  // 2080-2089
  0x0e4d3, 0x0c960, 0x0cce7, 0x05560, 0x0ab50, 0x10ad25, 0x06d20, 0x0ea50, 0x072a4, 0x068b0,
  // 2090-2099
  0x06978, 0x04ab0, 0x055b0, 0x105566, 0x0b6a0, 0x07520, 0x0b954, 0x0b450, 0x0a8b0, 0x0a4f2,
  // 2100-2109
  0x04ab0,
];
const LUNAR_NEW_YEAR = [  // 正月初一 [月,日]
  // 1900-1909
  [1,31], [2,19], [2,8], [1,29], [2,16], [2,4], [1,25], [2,13], [2,2], [1,22],
  // 1910-1919
  [2,10], [1,30], [2,18], [2,6], [1,26], [2,14], [2,3], [1,23], [2,11], [2,1],
  // 1920-1929
  [2,20], [2,8], [1,28], [2,16], [2,5], [1,24], [2,13], [2,2], [1,23], [2,10],
  // 1930-1939
  [1,30], [2,17], [2,6], [1,26], [2,14], [2,4], [1,24], [2,11], [1,31], [2,19],
  // 1940-1949
  [2,8], [1,27], [2,15], [2,5], [1,25], [2,13], [2,2], [1,22], [2,10], [1,29],
  // 1950-1959
  [2,17], [2,6], [1,27], [2,14], [2,3], [1,24], [2,12], [1,31], [2,18], [2,8],
  // 1960-1969
  [1,28], [2,15], [2,5], [1,25], [2,13], [2,2], [1,21], [2,9], [1,30], [2,17],
  // 1970-1979
  [2,6], [1,27], [2,15], [2,3], [1,23], [2,11], [1,31], [2,18], [2,7], [1,28],
  // 1980-1989
  [2,16], [2,5], [1,25], [2,13], [2,2], [2,20], [2,9], [1,29], [2,17], [2,6],
  // 1990-1999
  [1,27], [2,15], [2,4], [1,23], [2,10], [1,31], [2,19], [2,7], [1,28], [2,16],
  // 2000-2009
  [2,5], [1,24], [2,12], [2,1], [1,22], [2,9], [1,29], [2,18], [2,7], [1,26],
  // 2010-2019
  [2,14], [2,3], [1,23], [2,10], [1,31], [2,19], [2,8], [1,28], [2,16], [2,5],
  // 2020-2029
  [1,25], [2,12], [2,1], [1,22], [2,10], [1,29], [2,17], [2,6], [1,26], [2,13],
  // 2030-2039
  [2,3], [1,23], [2,11], [1,31], [2,19], [2,8], [1,28], [2,15], [2,4], [1,24],
  // 2040-2049
  [2,12], [2,1], [1,22], [2,10], [1,30], [2,17], [2,6], [1,26], [2,14], [2,2],
  // 2050-2059
  [1,23], [2,11], [2,1], [2,19], [2,8], [1,28], [2,15], [2,4], [1,24], [2,12],
  // 2060-2069
  [2,2], [1,21], [2,9], [1,29], [2,17], [2,5], [1,26], [2,14], [2,3], [1,23],
  // 2070-2079
  [2,11], [1,31], [2,19], [2,7], [1,27], [2,15], [2,5], [1,24], [2,12], [2,2],
  // 2080-2089
  [1,22], [2,9], [1,29], [2,17], [2,6], [1,26], [2,14], [2,3], [1,24], [2,10],
  // 2090-2099
  [1,30], [2,18], [2,7], [1,27], [2,15], [2,5], [1,25], [2,12], [2,1], [1,21],
  // 2100-2109
  [2,9],
];

// 农历月份 select options
const LUNAR_MONTH_OPTIONS = '<option value="1">正月</option><option value="2">二月</option><option value="3">三月</option><option value="4">四月</option><option value="5">五月</option><option value="6">六月</option><option value="7">七月</option><option value="8">八月</option><option value="9">九月</option><option value="10">十月</option><option value="11">十一月</option><option value="12">十二月</option>';


// 纳音
const NAYIN = {};
['甲子乙丑海中金','丙寅丁卯炉中火','戊辰己巳大林木','庚午辛未路旁土','壬申癸酉剑锋金',
 '甲戌乙亥山头火','丙子丁丑涧下水','戊寅己卯城头土','庚辰辛巳白蜡金','壬午癸未杨柳木',
 '甲申乙酉泉中水','丙戌丁亥屋上土','戊子己丑霹雳火','庚寅辛卯松柏木','壬辰癸巳长流水',
 '甲午乙未沙中金','丙申丁酉山下火','戊戌己亥平地木','庚子辛丑壁上土','壬寅癸卯金箔金',
 '甲辰乙巳覆灯火','丙午丁未天河水','戊申己酉大驿土','庚戌辛亥钗钏金','壬子癸丑桑柘木',
 '甲寅乙卯大溪水','丙辰丁巳沙中土','戊午己未天上火','庚申辛酉石榴木','壬戌癸亥大海水'
].forEach(s=>{for(let i=0;i<4;i+=2)NAYIN[s.substr(i,2)]=s.substr(4);});

// 藏干
const CANG_GAN = {
  '子':['癸'],'丑':['己','癸','辛'],'寅':['甲','丙','戊'],'卯':['乙'],
  '辰':['戊','乙','癸'],'巳':['丙','庚','戊'],'午':['丁','己'],'未':['己','丁','乙'],
  '申':['庚','壬','戊'],'酉':['辛'],'戌':['戊','辛','丁'],'亥':['壬','甲']
};

// 双胞胎后出者 日/时/命/身 支主气 & 藏干
const ZHI_TWIN_MAIN = {
  '子':'壬','丑':'癸','寅':'丙','卯':'甲','辰':'乙','巳':'庚',
  '午':'己','未':'丁','申':'壬','酉':'庚','戌':'辛','亥':'甲'
};
const ZHI_TWIN_CANG = {
  '子':['壬'],'丑':['癸','辛'],'寅':['丙','戊'],'卯':['甲'],
  '辰':['乙','癸'],'巳':['庚','戊'],'午':['己'],'未':['丁','乙'],
  '申':['壬','戊'],'酉':['庚'],'戌':['辛','丁'],'亥':['甲']
};
var twinPillars = ['ri','shi','ming','shen'];

// 十二长生表
const CS12_MAP = {
  '甲':['亥','子','丑','寅','卯','辰','巳','午','未','申','酉','戌'],
  '乙':['午','巳','辰','卯','寅','丑','子','亥','戌','酉','申','未'],
  '丙':['寅','卯','辰','巳','午','未','申','酉','戌','亥','子','丑'],
  '丁':['酉','申','未','午','巳','辰','卯','寅','丑','子','亥','戌'],
  '戊':['寅','卯','辰','巳','午','未','申','酉','戌','亥','子','丑'],
  '己':['酉','申','未','午','巳','辰','卯','寅','丑','子','亥','戌'],
  '庚':['巳','午','未','申','酉','戌','亥','子','丑','寅','卯','辰'],
  '辛':['子','亥','戌','酉','申','未','午','巳','辰','卯','寅','丑'],
  '壬':['申','酉','戌','亥','子','丑','寅','卯','辰','巳','午','未'],
  '癸':['卯','寅','丑','子','亥','戌','酉','申','未','午','巳','辰']
};
const CS12_N = ['长生','沐浴','冠带','临官','帝旺','衰','病','死','墓','绝','胎','养'];

// 纳音五行→阳干映射（纳运十二长生查找用）
const NAYIN_WX_YANG = { '木':'甲','火':'丙','土':'壬','金':'庚','水':'壬' };

// 空亡表（按日柱旬）
const KONG_WANG = {
  '甲子':'戌亥','乙丑':'戌亥','丙寅':'戌亥','丁卯':'戌亥','戊辰':'戌亥',
  '己巳':'戌亥','庚午':'戌亥','辛未':'戌亥','壬申':'戌亥','癸酉':'戌亥',
  '甲戌':'申酉','乙亥':'申酉','丙子':'申酉','丁丑':'申酉','戊寅':'申酉',
  '己卯':'申酉','庚辰':'申酉','辛巳':'申酉','壬午':'申酉','癸未':'申酉',
  '甲申':'午未','乙酉':'午未','丙戌':'午未','丁亥':'午未','戊子':'午未',
  '己丑':'午未','庚寅':'午未','辛卯':'午未','壬辰':'午未','癸巳':'午未',
  '甲午':'辰巳','乙未':'辰巳','丙申':'辰巳','丁酉':'辰巳','戊戌':'辰巳',
  '己亥':'辰巳','庚子':'辰巳','辛丑':'辰巳','壬寅':'辰巳','癸卯':'辰巳',
  '甲辰':'寅卯','乙巳':'寅卯','丙午':'寅卯','丁未':'寅卯','戊申':'寅卯',
  '己酉':'寅卯','庚戌':'寅卯','辛亥':'寅卯','壬子':'寅卯','癸丑':'寅卯',
  '甲寅':'子丑','乙卯':'子丑','丙辰':'子丑','丁巳':'子丑','戊午':'子丑',
  '己未':'子丑','庚申':'子丑','辛酉':'子丑','壬戌':'子丑','癸亥':'子丑'
};

// ============ 节气查表（JPL DE440s，1900-2100） ============
// 节气数据 1900-2100 (JPL DE440s)
// packed=daysFrom20000101*86400+seconds
const SOLAR_TERMS=[
 -3155263008,-3153990501,-3152714955,-3151432772,-3150142734,-3148842105,-3147530885,-3146207619,-3144873933,-3143529829,-3142178509,-3140821258,-3139462235,-3138103477,-3136749010,-3135400855,-3134061847,-3132733234,-3131416056,-3130110328,-3128815261,-3127529574,-3126251093,-3124977551, //1900
 -3123706041,-3122433857,-3121158053,-3119876150,-3118585792,-3117285430,-3115973783,-3114650839,-3113316621,-3111972964,-3110621057,-3109264376,-3107904789,-3106546617,-3105191677,-3103843994,-3102504628,-3101176307,-3099858855,-3098553269,-3097257973,-3095972370,-3094693684,-3093420247,
 -3092148549,-3090876527,-3089600555,-3088318861,-3087028391,-3085728250,-3084416597,-3083093795,-3081759715,-3080416030,-3079064455,-3077707535,-3076348462,-3074989851,-3073635506,-3072287260,-3070948457,-3069619522,-3068302532,-3066996304,-3065701376,-3064415118,-3063136780,-3061862711,
 -3060591419,-3059318830,-3058043365,-3056761194,-3055471309,-3054170755,-3052859688,-3051536523,-3050202919,-3048858940,-3047507614,-3046150546,-3044791445,-3043432916,-3042078292,-3040730346,-3039391100,-3038062620,-3036745138,-3035439458,-3034144038,-3032858356,-3031579522,-3030306015,
 -3029034218,-3027762170,-3026486193,-3025204550,-3023914142,-3022614127,-3021302510,-3019979912,-3018645726,-3017302304,-3015950382,-3014593760,-3013234139,-3011875865,-3010520929,-3009173056,-3007833761,-3006505227,-3005187905,-3003882097,-3002586940,-3001301087,-3000022518,-2998748803,
 -2997477212,-2996204924,-2994929091,-2993647182,-2992356904,-2991056588,-2989745171,-2988422215,-2987088395,-2985744563,-2984393225,-2983036157,-2981677239,-2980318502,-2978964222,-2977615922,-2976277132,-2974948242,-2973631262,-2972325162,-2971030252,-2969744145,-2968465791,-2967191816,
 -2965920431,-2964647843,-2963372205,-2962089970,-2960799872,-2959499270,-2958188001,-2956864887,-2955531130,-2954187342,-2952835903,-2951479130,-2950119922,-2948761685,-2947406943,-2946059226,-2944719864,-2943391538,-2942073943,-2940768354,-2939472823,-2938187206,-2936908271,-2935634840,
 -2934362952,-2933090990,-2931814909,-2930533339,-2929242812,-2927942857,-2926631150,-2925308604,-2923974421,-2922631042,-2921279259,-2919922657,-2918563286,-2917204960,-2915850278,-2914502233,-2913163113,-2911834302,-2910517073,-2909210944,-2907915858,-2906629712,-2905351269,-2904077343,
 -2902805968,-2901533551,-2900258001,-2898976001,-2897686020,-2896385602,-2895074449,-2893751361,-2892417735,-2891073748,-2889722492,-2888365292,-2887006354,-2885647589,-2884293232,-2882945015,-2881606097,-2880277339,-2878960183,-2877654226,-2876359112,-2875073156,-2873794616,-2872520829,
 -2871249320,-2869976978,-2868701282,-2867419333,-2866129186,-2864828857,-2863517469,-2862194569,-2860860584,-2859516941,-2858165197,-2856808501,-2855448996,-2854090806,-2852735885,-2851388221,-2850048838,-2848720563,-2847403045,-2846097482,-2844802050,-2843516418,-2842237543,-2840964045,
 -2839692155,-2838420096,-2837143990,-2835862345,-2834571841,-2833271860,-2831960257,-2830637690,-2829303673,-2827960224,-2826608651,-2825251911,-2823892770,-2822534256,-2821179802,-2819831592,-2818492701,-2817163789,-2815846765,-2814540565,-2813245627,-2811959382,-2810681018,-2809406928, //1910
 -2808135578,-2806862947,-2805587414,-2804305214,-2803015301,-2801714770,-2800403760,-2799080676,-2797747214,-2796403318,-2795052159,-2793695100,-2792336136,-2790977513,-2789622966,-2788274853,-2786935635,-2785606980,-2784289536,-2782983739,-2781688411,-2780402676,-2779123976,-2777850440,
 -2776578781,-2775306683,-2774030818,-2772749095,-2771458770,-2770158670,-2768847135,-2767524489,-2766190407,-2764847004,-2763495180,-2762138618,-2760779027,-2759420809,-2758065797,-2756717950,-2755378489,-2754049950,-2752732426,-2751426629,-2750131310,-2748845540,-2747566895,-2746293349,
 -2745021754,-2743749684,-2742473870,-2741192177,-2739901891,-2738601753,-2737290277,-2735967458,-2734633549,-2733289838,-2731938424,-2730581461,-2729222495,-2727863806,-2726509480,-2725161137,-2723822285,-2722493265,-2721176209,-2719869938,-2718574966,-2717288715,-2716010366,-2714736336,
 -2713465056,-2712192519,-2710917070,-2709634953,-2708345077,-2707044586,-2705733517,-2704410435,-2703076825,-2701732970,-2700381631,-2699024727,-2697665595,-2696307213,-2694952515,-2693604652,-2692265280,-2690936801,-2689619140,-2688313392,-2687017766,-2685732006,-2684453001,-2683179484,
 -2681907610,-2680635656,-2679359701,-2678078243,-2676787931,-2675488152,-2674176672,-2672854300,-2671520262,-2670177002,-2668825219,-2667468666,-2666109161,-2664750844,-2663395964,-2662047926,-2660708600,-2659379800,-2658062373,-2656756247,-2655460968,-2654174819,-2652896192,-2651622281,
 -2650350758,-2649078412,-2647802786,-2646520947,-2645230983,-2643930815,-2642619755,-2641296950,-2639963438,-2638619674,-2637268484,-2635911362,-2634552410,-2633193556,-2631839128,-2630490714,-2629151725,-2627822741,-2626505554,-2625199393,-2623904289,-2622618159,-2621339654,-2620065713,
 -2618794256,-2617521784,-2616246172,-2614964138,-2613674137,-2612373792,-2611062631,-2609739782,-2608406082,-2607062512,-2605711033,-2604354367,-2602995011,-2601636758,-2600281816,-2598934005,-2597594464,-2596266016,-2594948296,-2593642606,-2592347009,-2591061330,-2589782363,-2588508884,
 -2587236958,-2585964951,-2584688837,-2583407263,-2582116767,-2580816888,-2579505311,-2578182901,-2576848932,-2575505696,-2574154164,-2572797648,-2571438494,-2570080140,-2568725578,-2567377396,-2566038296,-2564709286,-2563392005,-2562085658,-2560790491,-2559504141,-2558225632,-2556951535,
 -2555680134,-2554407582,-2553132059,-2551849977,-2550560094,-2549259677,-2547948700,-2546625707,-2545292302,-2543948477,-2542597425,-2541240410,-2539881590,-2538522954,-2537168541,-2535820324,-2534481165,-2533152303,-2531834822,-2530528747,-2529233331,-2527947312,-2526668554,-2525394799,
 -2524123174,-2522850962,-2521575235,-2520293485,-2519003360,-2517703267,-2516391927,-2515069275,-2513735344,-2512391919,-2511040199,-2509683635,-2508324105,-2506965928,-2505610927,-2504263147,-2502923629,-2501595137,-2500277472,-2498971663,-2497676126,-2496390297,-2495111404,-2493837805, //1920
 -2492566000,-2491293942,-2490018009,-2488736424,-2487446113,-2486146162,-2484834699,-2483512086,-2482178163,-2480834619,-2479483134,-2478126284,-2476767226,-2475408606,-2474054216,-2472705914,-2471367042,-2470038038,-2468720984,-2467414685,-2466119691,-2464833352,-2463554935,-2462280777,
 -2461009406,-2459736747,-2458461236,-2457179052,-2455889191,-2454588708,-2453277740,-2451954709,-2450621249,-2449277407,-2447926204,-2446569221,-2445210174,-2443851642,-2442496993,-2441148971,-2439809641,-2438481049,-2437163455,-2435857648,-2434562108,-2433276310,-2431997381,-2430723807,
 -2429451980,-2428179934,-2426904003,-2425622439,-2424332154,-2423032298,-2421720873,-2420398486,-2419064525,-2417721306,-2416369561,-2415013058,-2413653488,-2412295191,-2410940151,-2409592114,-2408252590,-2406923809,-2405606217,-2404300170,-2403004799,-2401718803,-2400440145,-2399166426,
 -2397894886,-2396622720,-2395347047,-2394065344,-2392775287,-2391475215,-2390164032,-2388841307,-2387507680,-2386163995,-2384812728,-2383455660,-2382096654,-2380737771,-2379383285,-2378034745,-2376695688,-2375366526,-2374049290,-2372742957,-2371447867,-2370161637,-2368883239,-2367609294,
 -2366338025,-2365065610,-2363790214,-2362508239,-2361218430,-2359918092,-2358607072,-2357284154,-2355950549,-2354606845,-2353255437,-2351898624,-2350539324,-2349180931,-2347825994,-2346478034,-2345138417,-2343809819,-2342491977,-2341186156,-2339890446,-2338604694,-2337325682,-2336052224,
 -2334780362,-2333508475,-2332232524,-2330951136,-2329660838,-2328361152,-2327049721,-2325727456,-2324393518,-2323050353,-2321698721,-2320342221,-2318982882,-2317624534,-2316269766,-2314921585,-2313582267,-2312253226,-2310935727,-2309629324,-2308333957,-2307047567,-2305768900,-2304494821,
 -2303223342,-2301950911,-2300675417,-2299393565,-2298103802,-2296803677,-2295492853,-2294170121,-2292836836,-2291493151,-2290142134,-2288785091,-2287426223,-2286067418,-2284712934,-2283364494,-2282025293,-2280696206,-2279378714,-2278072421,-2276777005,-2275490783,-2274212040,-2272938113,
 -2271666547,-2270394222,-2269118636,-2267836866,-2266546984,-2265246967,-2263935947,-2262613419,-2261279810,-2259936481,-2258584990,-2257228436,-2255868963,-2254510684,-2253155568,-2251807633,-2250467913,-2249139292,-2247821427,-2246515550,-2245219848,-2243934006,-2242654982,-2241381402,
 -2240109497,-2238837487,-2237561496,-2236280010,-2234989701,-2233689932,-2232378545,-2231056203,-2229722399,-2228379166,-2227027770,-2225671186,-2224312120,-2222953624,-2221599097,-2220250746,-2218911644,-2217582484,-2216265197,-2214958735,-2213663572,-2212377136,-2211098634,-2209824457,
 -2208553066,-2207280442,-2206004951,-2204722833,-2203433025,-2202132637,-2200821776,-2199498874,-2198165599,-2196821900,-2195470936,-2194114052,-2192755239,-2191396703,-2190042201,-2188694041,-2187354716,-2186025866,-2184708171,-2183402062,-2182106408,-2180820354,-2179541382,-2178267649, //1930
 -2176995884,-2175723771,-2174447982,-2173166405,-2171876293,-2170576445,-2169265195,-2167942835,-2166609046,-2165265897,-2163914314,-2162557938,-2161198484,-2159840339,-2158485325,-2157137405,-2155797782,-2154469024,-2153151207,-2151845093,-2150549427,-2149263341,-2147984403,-2146710648,
 -2145438915,-2144166813,-2142891058,-2141609519,-2140319460,-2139019607,-2137708440,-2136385939,-2135052311,-2133708827,-2132357555,-2131000665,-2129641682,-2128282939,-2126928510,-2125580048,-2124241048,-2122911869,-2121594642,-2120288188,-2118993039,-2117706614,-2116428118,-2115153967,
 -2113882619,-2112610060,-2111334663,-2110052644,-2108762935,-2107462636,-2106151790,-2104828926,-2103495515,-2102151815,-2100800580,-2099443713,-2098084561,-2096726096,-2095371288,-2094023280,-2092683773,-2091355154,-2090037386,-2088731537,-2087435840,-2086150015,-2084870954,-2083597372,
 -2082325431,-2081053408,-2079777403,-2078495923,-2077205640,-2075905948,-2074594601,-2073272414,-2071938576,-2070595528,-2069243938,-2067887547,-2066528154,-2065169891,-2063815001,-2062466899,-2061127452,-2059798511,-2058480920,-2057174645,-2055879218,-2054592959,-2053314228,-2052040257,
 -2050768680,-2049496322,-2048220698,-2046938904,-2045649009,-2044348957,-2043038040,-2041715416,-2040382098,-2039038532,-2037687524,-2036330548,-2034971687,-2033612845,-2032258350,-2030909784,-2029570575,-2028241333,-2026923880,-2025617471,-2024322168,-2023035897,-2021757328,-2020483395,
 -2019212022,-2017939685,-2016664264,-2015382439,-2014092673,-2012792552,-2011481616,-2010158956,-2008825430,-2007481976,-2006130580,-2004773925,-2003414522,-2002056149,-2000701029,-1999352990,-1998013186,-1996684464,-1995366475,-1994060537,-1992764741,-1991478919,-1990199885,-1988926421,
 -1987654594,-1986382762,-1985106886,-1983825579,-1982535355,-1981235718,-1979924337,-1978602071,-1977268184,-1975924992,-1974573450,-1973216903,-1971857663,-1970499206,-1969144497,-1967796151,-1966456855,-1965127646,-1963810165,-1962503631,-1961208304,-1959921832,-1958643242,-1957369122,
 -1956097750,-1954825296,-1953549921,-1952268046,-1950978394,-1949678237,-1948367501,-1947044738,-1945711510,-1944367811,-1943016821,-1941659807,-1940300938,-1938942196,-1937587659,-1936239273,-1934899933,-1933570851,-1932253136,-1930946795,-1929651121,-1928364856,-1927085901,-1925812018,
 -1924540348,-1923268179,-1921992593,-1920711066,-1919421249,-1918121514,-1916810576,-1915488314,-1914154756,-1912811621,-1911460120,-1910103656,-1908744119,-1907385823,-1906030612,-1904682551,-1903342697,-1902013855,-1900695822,-1899389670,-1898093807,-1896807710,-1895528597,-1894254863,
 -1892982998,-1891710975,-1890435166,-1889153796,-1887863781,-1886564197,-1885253145,-1883930966,-1882597443,-1881254238,-1879902976,-1878546236,-1877187137,-1875828375,-1874473729,-1873125108,-1871785865,-1870456487,-1869139075,-1867832460,-1866537212,-1865250682,-1863972147,-1862697937, //1940
 -1861426583,-1860154002,-1858878633,-1857596637,-1856307013,-1855006798,-1853696122,-1852373393,-1851040227,-1849696650,-1848345666,-1846988823,-1845629833,-1844271250,-1842916465,-1841568206,-1840228589,-1838899655,-1837581725,-1836275589,-1834979774,-1833693750,-1832414659,-1831140971,
 -1829869080,-1828597010,-1827321104,-1826039611,-1824749458,-1823449782,-1822138588,-1820816471,-1819482807,-1818139899,-1816788465,-1815432245,-1814072911,-1812714774,-1811359800,-1810011726,-1808672050,-1807343032,-1806025115,-1804718709,-1803422950,-1802136596,-1800857610,-1799583646,
 -1798311927,-1797039686,-1795764013,-1794482405,-1793192505,-1791892663,-1790581746,-1789259329,-1787926015,-1786582648,-1785231680,-1783874881,-1782516087,-1781157347,-1779802907,-1778454318,-1777115108,-1775785716,-1774468188,-1773161522,-1771866092,-1770579530,-1769300846,-1768026673,
 -1766755261,-1765482792,-1764207442,-1762925590,-1761635991,-1760335903,-1759025179,-1757702551,-1756369234,-1755025770,-1753674564,-1752317882,-1750958655,-1749600267,-1748245286,-1746897230,-1745557485,-1744228721,-1742910694,-1741604659,-1740308737,-1739022765,-1737743557,-1736469930,
 -1735197950,-1733926001,-1732650054,-1731368725,-1730078536,-1728778986,-1727467709,-1726145605,-1724811820,-1723468804,-1722117292,-1720760895,-1719401609,-1718043293,-1716688512,-1715340300,-1714000928,-1712671832,-1711354267,-1710047802,-1708752365,-1707465906,-1706187156,-1704913004,
 -1703641437,-1702368941,-1701093382,-1699811506,-1698521738,-1697221658,-1695910904,-1694588287,-1693255128,-1691911582,-1690560694,-1689203758,-1687844967,-1686486195,-1685131721,-1683783235,-1682443971,-1681114780,-1679797169,-1678490735,-1677195186,-1675908839,-1674630004,-1673356018,
 -1672084435,-1670812125,-1669536594,-1668254903,-1666965139,-1665665257,-1664354407,-1663032053,-1661698638,-1660355475,-1659004143,-1657647689,-1656288266,-1654929966,-1653574764,-1652226678,-1650886750,-1649557900,-1648239777,-1646933666,-1645637752,-1644351758,-1643072643,-1641799051,
 -1640527201,-1639255312,-1637979494,-1636698215,-1635408142,-1634108610,-1632797455,-1631475325,-1630141682,-1628798559,-1627447194,-1626090582,-1624731405,-1623372765,-1622018036,-1620669464,-1619330116,-1618000715,-1616683199,-1615376537,-1614081222,-1612794686,-1611516156,-1610242021,
 -1608970745,-1607698301,-1606423044,-1605141192,-1603851657,-1602551535,-1601240897,-1599918180,-1598585019,-1597241376,-1595890405,-1594533451,-1593174519,-1591815814,-1590461117,-1589112722,-1587773165,-1586444066,-1585126152,-1583819837,-1582524028,-1581237852,-1579958810,-1578685043,
 -1577413291,-1576141239,-1574865568,-1573584164,-1572294288,-1570994707,-1569683748,-1568361668,-1567028134,-1565685186,-1564333754,-1562977454,-1561618017,-1560259820,-1558904702,-1557556624,-1556216794,-1554887802,-1553569715,-1552263331,-1550967391,-1549681065,-1548401913,-1547128016, //1950
 -1545856190,-1544584091,-1543308407,-1542027036,-1540737213,-1539437673,-1538126855,-1536804732,-1535471459,-1534128292,-1532777261,-1531420526,-1530061582,-1528702776,-1527348167,-1525999449,-1524660123,-1523330604,-1522013031,-1520706254,-1519410817,-1518124150,-1516845474,-1515571211,
 -1514299829,-1513027310,-1511752040,-1510470212,-1509180776,-1507880790,-1506570311,-1505247816,-1503914773,-1502571384,-1501220395,-1499863663,-1498504534,-1497145967,-1495790955,-1494442646,-1493102792,-1491773795,-1490455670,-1489149482,-1487853519,-1486567476,-1485288280,-1484014626,
 -1482742691,-1481470734,-1480194860,-1478913549,-1477623466,-1476323985,-1475012856,-1473690892,-1472357274,-1471014446,-1469663047,-1468306818,-1466947518,-1465589285,-1464234337,-1462886104,-1461546449,-1460217261,-1458899388,-1457592839,-1456297156,-1455010690,-1453731794,-1452457727,
 -1451186095,-1449913751,-1448638171,-1447356475,-1446066701,-1444766810,-1443456064,-1442133642,-1440800524,-1439457170,-1438106363,-1436749572,-1435390862,-1434032118,-1432677668,-1431329060,-1429989741,-1428660298,-1427342575,-1426035833,-1424740180,-1423453562,-1422174702,-1420900553,
 -1419629060,-1418356702,-1417081356,-1415799688,-1414510155,-1413210309,-1411899688,-1410577343,-1409244134,-1407900953,-1406549807,-1405193332,-1403834060,-1402475741,-1401120609,-1399772478,-1398432506,-1397103561,-1395785284,-1394479031,-1393182902,-1391896761,-1390617445,-1389343760,
 -1388071795,-1386799915,-1385524097,-1384242934,-1382952945,-1381653596,-1380342543,-1379020607,-1377687014,-1376344059,-1374992664,-1373636189,-1372276930,-1370918419,-1369563598,-1368215126,-1366875676,-1365546311,-1364228659,-1362921953,-1361626458,-1360339822,-1359061085,-1357786845,
 -1356515387,-1355242896,-1353967534,-1352685734,-1351396205,-1350096225,-1348785683,-1347463140,-1346130109,-1344786588,-1343435727,-1342078782,-1340719921,-1339361122,-1338006488,-1336657959,-1335318480,-1333989249,-1332671413,-1331364960,-1330069209,-1328782870,-1327503854,-1326229896,
 -1324958151,-1323685904,-1322410260,-1321128705,-1319838919,-1318539264,-1317228471,-1315906393,-1314573060,-1313230150,-1311878879,-1310522599,-1309163206,-1307804985,-1306449780,-1305101658,-1303761681,-1302432682,-1301114462,-1299808132,-1298512096,-1297225864,-1295946634,-1294672830,
 -1293400912,-1292128881,-1290853080,-1289571758,-1288281814,-1286982341,-1285671427,-1284349423,-1283016087,-1281673085,-1280322006,-1278965426,-1277606418,-1276247685,-1274892966,-1273544201,-1272204736,-1270875105,-1269557422,-1268250552,-1266955086,-1265668395,-1264389773,-1263115552,
 -1261844263,-1260571810,-1259296622,-1258014834,-1256725444,-1255425452,-1254114997,-1252792458,-1251459456,-1250116000,-1248765096,-1247408274,-1246049251,-1244690565,-1243335625,-1241987147,-1240647287,-1239318080,-1237999890,-1236693500,-1235397488,-1234111308,-1232832145,-1231558455, //1960
 -1230286653,-1229014743,-1227739065,-1226457823,-1225167931,-1223868484,-1222557483,-1221235507,-1219901934,-1218559075,-1217207649,-1215851405,-1214492013,-1213133795,-1211778709,-1210430498,-1209090657,-1207761464,-1206443354,-1205136768,-1203840838,-1202554349,-1201275256,-1200001242,
 -1198729513,-1197457335,-1196181768,-1194900335,-1193610639,-1192311038,-1191000355,-1189678169,-1188345040,-1187001820,-1185650934,-1184294163,-1182935343,-1181576533,-1180221988,-1178873262,-1177533887,-1176204297,-1174886535,-1173579610,-1172283914,-1170997098,-1169718210,-1168443894,
 -1167172422,-1165899977,-1164624744,-1163343094,-1162053779,-1160754029,-1159443689,-1158121441,-1156788491,-1155445321,-1154094343,-1152737768,-1151378552,-1150020057,-1148664884,-1147316557,-1145976498,-1144647399,-1143329035,-1142022680,-1140726470,-1139440247,-1138160852,-1136887096,
 -1135615068,-1134343145,-1133067313,-1131786171,-1130496248,-1129197017,-1127886107,-1126564380,-1125230946,-1123888222,-1122536904,-1121180601,-1119821279,-1118462845,-1117107838,-1115759346,-1114419641,-1113090209,-1111772316,-1110465568,-1109169900,-1107883275,-1106604424,-1105330237,
 -1104058690,-1102786276,-1101510841,-1100229139,-1098939570,-1097639723,-1096329205,-1095006844,-1093673916,-1092330595,-1090979881,-1089623067,-1088264325,-1086905517,-1085550932,-1084202244,-1082862737,-1081533248,-1080215339,-1078908610,-1077612814,-1076326257,-1075047274,-1073773182,
 -1072501545,-1071229227,-1069953737,-1068672138,-1067382525,-1066082833,-1064772218,-1063450117,-1062116980,-1060774085,-1059423029,-1058066805,-1056707586,-1055349415,-1053994269,-1052646144,-1051306083,-1049977019,-1048658601,-1047352161,-1046055890,-1044769561,-1043490140,-1042216317,
 -1040944306,-1039672355,-1038396556,-1037115386,-1035825493,-1034526198,-1033215325,-1031893499,-1030560161,-1029217334,-1027866227,-1026509836,-1025150806,-1023792255,-1022437514,-1021088861,-1019749343,-1018419723,-1017101936,-1015794980,-1014499363,-1013212538,-1011933757,-1010659427,
 -1009388034,-1008115559,-1006840361,-1005558652,-1004269339,-1002969485,-1001659151,-1000336738,-999003857,-997660454,-996309660,-994952809,-993593907,-992235161,-990880373,-989531833,-988192119,-986862834,-985544741,-984238230,-982942247,-981655893,-980376709,-979102819,
 -977830995,-976558913,-975283271,-974001935,-972712170,-971412719,-970101913,-968779992,-967446617,-966103820,-964752514,-963396302,-962036913,-960678714,-959323557,-957975402,-956635479,-955306390,-953988204,-952681741,-951385723,-950099339,-948820125,-947546182,
 -946274302,-945002175,-943726458,-942445096,-941155295,-939855825,-938545098,-937223108,-935889976,-934546964,-933196068,-931839445,-930480570,-929121791,-927767156,-926418371,-925078929,-923749265,-922431510,-921124550,-919828939,-918542130,-917263363,-915989063, //1970
 -914717697,-913445243,-912170078,-910888386,-909599119,-908299314,-906989043,-905666749,-904333915,-902990702,-901639871,-900283227,-898924134,-897565517,-896210389,-894861886,-893521790,-892192509,-890874089,-889567613,-888271406,-886985164,-885705859,-884432167,
 -883160291,-881888462,-880612789,-879331718,-878041916,-876742717,-875431870,-874110154,-872776731,-871434032,-870082682,-868726431,-867367027,-866008651,-864653491,-863305021,-861965095,-860635637,-859317496,-858010714,-856714837,-855428240,-854149277,-852875228,
 -851603683,-850331510,-849056150,-847774733,-846485247,-845185655,-843875169,-842552980,-841220019,-839876772,-838525991,-837169167,-835810360,-834451469,-833096833,-831747993,-830408438,-829078734,-827760766,-826453791,-825157943,-823871160,-822592176,-821317939,
 -820046405,-818774062,-817498796,-816217281,-814927975,-813628405,-812318102,-810996071,-809663169,-808320238,-806969301,-805612945,-804253735,-802895390,-801540171,-800191881,-798851697,-797522496,-796203922,-794897365,-793600923,-792314495,-791034924,-789761044,
 -788488951,-787217027,-785941250,-784660219,-783370455,-782071402,-780760712,-779439169,-778105970,-776763381,-775412280,-774056016,-772696837,-771338297,-769983308,-768634585,-767294804,-765965090,-764647078,-763340040,-762044244,-760757358,-759478431,-758204067,
 -756932559,-755660095,-754384834,-753103207,-751813915,-750514226,-749204014,-747881825,-746549136,-745205936,-743855327,-742498550,-741139750,-739780895,-738426100,-737077306,-735737509,-734407910,-733089718,-731782920,-730486886,-729200311,-727921144,-726647093,
 -725375338,-724103136,-722827597,-721546175,-720256553,-718957065,-717646457,-716324568,-714991441,-713648740,-712297679,-710941576,-709582328,-708224183,-706868987,-705520787,-704180659,-702851447,-701532964,-700226361,-698930051,-697643581,-696364151,-695090212,
 -693818208,-692546162,-691270383,-689989145,-688699309,-687399988,-686089241,-684767430,-683434288,-682091495,-680740615,-679384228,-678025384,-676666786,-675312141,-673963394,-672623857,-671294077,-669976146,-668668972,-667373158,-666086124,-664807198,-663532743,
 -662261308,-660988806,-659713663,-658432009,-657142824,-655843086,-654532924,-653210679,-651877971,-650534770,-649184090,-647827431,-646468524,-645109889,-643754947,-642406397,-641066415,-639737018,-638418598,-637111931,-635815634,-634529155,-633249732,-631975815,
 -630703868,-629431884,-628156233,-626875102,-625585411,-624286220,-622975519,-621653840,-620320532,-618977878,-617626576,-616270380,-614910964,-613552682,-612197490,-610849163,-609509193,-608179880,-606861645,-605554950,-604258906,-602972317,-601693125,-600419036, //1980
 -599147242,-597875042,-596599477,-595318102,-594028493,-592729030,-591418498,-590096488,-588763513,-587420435,-586069642,-584712920,-583354089,-581995219,-580640571,-579291712,-577952208,-576622489,-575304628,-573997630,-572701891,-571415043,-570136126,-568861769,
 -567590246,-566317748,-565042472,-563760810,-562471525,-561171850,-559861640,-558539553,-557206801,-555863827,-554513047,-553156621,-551797527,-550439078,-549083896,-547735488,-546395299,-545066030,-543747473,-542440935,-541144556,-539858203,-538578717,-537304912,
 -536032879,-534760985,-533485219,-532204166,-530914368,-529615276,-528304539,-526982991,-525649751,-524307215,-522956059,-521599880,-520240608,-518882155,-517527024,-516178353,-514838399,-513508705,-512190537,-510883545,-509587669,-508300901,-507021981,-505747806,
 -504476350,-503204099,-501928876,-500647428,-499358122,-498058541,-496748261,-495426116,-494093343,-492750146,-491399484,-490042667,-488683854,-487324908,-485970128,-484621189,-483281412,-481951627,-480633447,-479326462,-478030469,-476743763,-475464717,-474190632,
 -472919096,-471646947,-470371693,-469090358,-467801019,-466501577,-465191186,-463869254,-462536248,-461193425,-459842405,-458486153,-457126885,-455768615,-454413345,-453065060,-451724819,-450395554,-449076928,-447770289,-446473832,-445187355,-443907821,-442633942,
 -441361919,-440090030,-438814339,-437533350,-436243673,-434944640,-433634034,-432312473,-430979365,-429636727,-428285738,-426929403,-425570355,-424211738,-422856864,-421508053,-420168324,-418838469,-417520396,-416213149,-414917231,-413630140,-412351144,-411076673,
 -409805220,-408532778,-407257701,-405976205,-404687184,-403387683,-402077753,-400755749,-399423266,-398080199,-396729662,-395372956,-394014080,-392655238,-391300246,-389951410,-388611353,-387281684,-385963220,-384656349,-383360060,-382073437,-380794067,-379520047,
 -378248191,-376976144,-375700632,-374419494,-373130008,-371830885,-370520457,-369198914,-367865897,-366523400,-365172308,-363816209,-362456826,-361098535,-359743185,-358394758,-357054510,-355725070,-354406532,-353099755,-351803466,-350516882,-349237532,-347963528,
 -346691645,-345419582,-344143971,-342862771,-341573152,-340273906,-338963406,-337641665,-336308765,-334965989,-333615287,-332258820,-330900034,-329541272,-328186567,-326837628,-325497965,-324168024,-322849960,-321542692,-320246788,-318959723,-317680743,-316406280,
 -315134807,-313862308,-312587161,-311305559,-310016444,-308716845,-307406826,-306084809,-304752275,-303409357,-302058822,-300702433,-299343572,-297985110,-296630069,-295281551,-293941353,-292611871,-291293173,-289986364,-288689792,-287403185,-286123551,-284849581, //1990
 -283577514,-282305576,-281029897,-279748902,-278459266,-277160285,-275849719,-274528299,-273195188,-271852786,-270501703,-269145674,-267786420,-266428133,-265072965,-263724431,-262384359,-261054716,-259736333,-258429291,-257133129,-255846256,-254567039,-253292782,
 -252021090,-250748851,-249473504,-248192191,-246902873,-245603518,-244293293,-242971387,-241638680,-240295672,-238945060,-237588351,-236229586,-234870671,-233515958,-232166994,-230827302,-229497435,-228179314,-226872174,-225576179,-224289249,-223010149,-221735807,
 -220464209,-219191832,-217916572,-216635091,-215345849,-214046363,-212736171,-211414261,-210081498,-208738697,-207387887,-206031616,-204672479,-203314151,-201958923,-200610584,-199270334,-197941053,-196622399,-195315773,-194019268,-192732791,-191453172,-190179253,
 -188907114,-187635157,-186359345,-185078302,-183788540,-182489520,-181178894,-179857441,-178524356,-177181893,-175830909,-174474748,-173115640,-171757142,-170402140,-169053376,-167713495,-166383649,-165065458,-163758240,-162462265,-161175243,-159896227,-158621838,
 -157350356,-156077975,-154802830,-153521358,-152232237,-150932736,-149622715,-148300713,-146968197,-145625149,-144274652,-142917938,-141559141,-140200221,-138845297,-137496311,-136156286,-134826421,-133507968,-132200910,-130904664,-129617917,-128338665,-127064593,
 -125792915,-124520852,-123245529,-121964358,-120675024,-119375817,-118065481,-116743808,-115410841,-114068215,-112717154,-111360977,-110001601,-108643279,-107287873,-105939432,-104599057,-103269595,-101950879,-100644079,-99347607,-98061036,-96781560,-95507648,
 -94235733,-92963850,-91688284,-90407312,-89117753,-87818721,-86508224,-85186632,-83853634,-82510928,-81160049,-79803605,-78444638,-77085875,-75731023,-74382050,-73042272,-71712255,-70394091,-69086716,-67790722,-66503548,-65224509,-63949979,
 -62678513,-61406037,-60130990,-58849508,-57560567,-56261129,-54951304,-53629397,-52297011,-50954075,-49603598,-48247046,-46888176,-45529478,-44174411,-42825664,-41485446,-40155769,-38837056,-37530085,-36233498,-34946747,-33667105,-32393013,
 -31120973,-29848961,-28573378,-27292392,-26002939,-24704052,-23393724,-22072442,-20739541,-19397256,-18046254,-16690254,-15330902,-13972554,-12617154,-11268537,-9928202,-8598511,-7279899,-5972868,-4676529,-3389711,-2110353,-836173,
 435640,1707781,2983222,4264397,5553758,6852914,8163117,9484770,10817409,12160164,13510713,14867262,16226036,17584960,18939779,20288911,21628749,22958855,24277091,25584448,26880483,28167560,29446621,30721045, //2000
 31992555,33264977,34540129,35821635,37110749,38410242,39720262,41042152,42374689,43717451,45068015,46424263,47783201,49141574,50496740,51845228,53185570,54515068,55833901,57140735,58437412,59724027,61003732,62277689,
 63549810,64821721,66097445,67378398,68668052,69966968,71277496,72598828,73931836,75274145,76625086,77981064,79340171,80698491,82053558,83402218,84742262,86072123,87390558,88697869,89994108,91281224,92560453,93834862,
 95106463,96378754,97653919,98935212,100224293,101523585,102833549,104155366,105487829,106830743,108181183,109537827,110896539,112255448,113610258,114959290,116299214,117629209,118947632,120254906,121551191,122838201,124117509,125391828,
 126663512,127935742,129210972,130492199,131781337,133080518,134390598,135712224,137044947,138387552,139738425,141094612,142453876,143812209,145167575,146515995,147856374,149185790,150504557,151811329,153107913,154394501,155674137,156948096,
 158220179,159492093,160767782,162048715,163338310,164637205,165947656,167269034,168601970,169944444,171295312,172651567,174010594,175369241,176724202,178073127,179413000,180742990,182061198,183368540,184664547,185951698,187230762,188505296,
 189776817,191049318,192324436,193605934,194894918,196194333,197504128,198825963,200158237,201501092,202851418,204207950,205566687,206925461,208280447,209629354,210969541,212299402,213618081,214925187,216221689,217508504,218788007,220062125,
 221334009,222606049,223881492,225162535,226451879,227750844,229061078,230382422,231715223,233057515,234408424,235764385,237123703,238482010,239837474,241186078,242526568,243856273,245175089,246482123,247778641,249065393,250344845,251618868,
 252890690,254162611,255438024,256718973,258008328,259307297,260617551,261939067,263271805,264614453,265965103,267321561,268680409,270039288,271394170,272743334,274083248,275413469,276731797,278039318,279335433,280622660,281901738,283176225,
 284447647,285720019,286994987,288276366,289565251,290864617,292174426,293496263,294828649,296171469,297521943,298878331,300237209,301595742,302950868,304299513,305639855,306969514,308288402,309595407,310892174,312178953,313458733,314732807,
 316004927,317276861,318552470,319833337,321122780,322421531,323731828,325052987,326385840,327728033,329078963,330434904,331794144,333152472,334507748,335856417,337196681,338526541,339845188,341152503,342448949,343736073,345015503,346289907, //2010
 347561678,348833912,350109176,351390319,352679398,353978443,355288318,356609845,357942193,359284870,360635240,361991790,363350520,364709510,366064406,367413639,368753653,370083878,371402345,372709818,374006095,375293269,376572540,377847002,
 379118635,380390990,381666143,382947456,384236462,385535665,386845535,388167124,389499580,390842132,392192754,393548929,394908043,396266451,397621832,398970409,400310940,401640538,402959502,404266413,405563157,406849808,408129536,409403496,
 410675618,411947503,413223205,414504095,415793690,417092514,418402947,419724197,421057090,422399370,423750200,425106237,426465276,427823758,429178821,430527702,431867775,433197848,434516309,435823789,437120033,438407287,439686512,440961060,
 442232651,443505075,444780196,446061569,447350535,448649825,449959599,451281332,452613566,453956343,455306583,456663074,458021686,459380482,460735349,462084359,463424486,464754544,466073250,467380623,468677200,469964291,471243846,472518181,
 473790033,475062195,476337508,477618589,478907740,480206709,481516747,482838111,484170755,485513087,486863891,488219875,489579135,490937426,492292883,493641436,494981973,496311632,497630569,498937603,500234318,501521117,502800801,504074876,
 505346902,506618825,507894362,509175223,510464612,511763411,513073651,514394966,515727713,517070189,518420910,519777251,521136202,522495012,523849982,525199108,526539065,527869267,529187603,530495133,531791262,533078543,534357668,535632250,
 536903744,538176216,539451243,540732679,542021563,543320917,544630639,545952420,547284662,548627455,549977796,551334248,552693041,554051721,555406799,556755612,558095916,559425707,560744528,562051601,563348269,564635079,565914759,567188876,
 568460924,569732941,571008509,572289480,573578890,574877727,576187967,577509152,578841922,580184077,581534948,582890837,584250112,585608420,586963840,588312513,589652982,590982845,592301683,593608943,594905506,596192489,597471955,598746164,
 600017937,601289972,602565259,603846236,605135384,606434305,607744286,609065716,610398165,611740747,613091184,614447654,615806431,617165422,618520383,619869720,621209812,622540210,623858737,625166384,626462662,627749936,629029108,630303566,
 631575006,632847280,634122199,635403420,636692213,637991377,639301090,640622728,641955083,643297757,644648305,646004620,647363667,648722212,650077571,651426296,652766883,654096639,655415715,656722772,658019635,659306385,660586170,661860140, //2020
 663132205,664403991,665679527,666960238,668249620,669548248,670858506,672179603,673512430,674854626,676205526,677561529,678920728,680279185,681634438,682983298,684323576,685653665,686972342,688279870,689576325,690863623,692143023,693417558,
 694689243,695961546,697236647,698517781,699806625,701105604,702415214,703736656,705068757,706411354,707761548,709118031,710476680,711835619,713190549,714539770,715879938,717210222,718528947,719836541,721133129,722420429,723699975,724974493,
 726246290,727518573,728793753,730074858,731363774,732662666,733972383,735293617,736625925,737968151,739318701,740674669,742033841,743392228,744747773,746096479,747437202,748766999,750086135,751393252,752690135,753976962,755256777,756530841,
 757802962,759074840,760350427,761631190,762920566,764219184,765529337,766850385,768183005,769525170,770875793,772231859,773590803,774949465,776304556,777653702,778993880,780324219,781642797,782950484,784246804,785534189,786813422,788088034,
 789359566,790632007,791907028,793188394,794477236,795776488,797086113,798407761,799739831,801082478,802432591,803788935,805147499,806506167,807861094,809210031,810550316,811880360,813199272,814506655,815803442,817090534,818370274,819644585,
 820916589,822188696,823464127,824745115,826034339,827333157,828643199,829964346,831296923,832639004,833989701,835345470,836704617,838062785,839418164,840766728,842107277,843437113,844756157,846063476,847360324,848647400,849927151,851201414,
 852473397,853745390,855020778,856301608,857590771,858889481,860199449,861520657,862853111,864195494,865545948,866902250,868261023,869619879,870974806,872324059,873664106,874994503,876313024,877620772,878917113,880204573,881483860,882758529,
 884030078,885302515,886577474,887858761,889147488,890446628,891756185,893077768,894409930,895752588,897102959,898459320,899818218,901176838,902532069,903880855,905221328,906551118,907870110,909177202,910474035,911760862,913040679,914314779,
 915586914,916858852,918134446,919415275,920704655,922003318,923313501,924634541,925967264,927309352,928660198,930016097,931375344,932733725,934089104,935437896,936778313,938108310,939427087,940734487,942031005,943318163,944597627,945872046,
 947143834,948416063,949691308,950972396,952261398,953560325,954870060,956191414,957523578,958866065,960216269,961572678,962931329,964290293,965645239,966994583,968334770,969665213,970983916,972291633,973588124,974875476,976154857,977429377, //2030
 978700988,979973278,981248298,982529455,983818261,985117258,986426902,987748274,989080511,990422875,991773341,993129428,994488531,995847028,997202576,998551399,999892209,1001222118,1002541377,1003848567,1005145540,1006432357,1007712173,1008986133,
 1010258166,1011529877,1012805337,1014085933,1015375213,1016673713,1017983856,1019304848,1020637552,1021979699,1023330479,1024686526,1026045654,1027404285,1028759563,1030108700,1031449074,1032779453,1034098223,1035405974,1036702456,1037989871,1039269200,1040543756,
 1041815287,1043087567,1044362495,1045643629,1046932340,1048231363,1049540887,1050862387,1052194426,1053537058,1054887206,1056243668,1057602297,1058961169,1060316145,1061665311,1063005621,1064335900,1065654836,1066962457,1068259265,1069546570,1070826296,1072100760,
 1073372671,1074644838,1075920070,1077201012,1078489944,1079788650,1081098375,1082419424,1083751749,1085093814,1086444401,1087800252,1089159458,1090517781,1091873346,1093222066,1094562840,1095892775,1097212027,1098519387,1099816420,1101103498,1102383410,1103657640,
 1104929743,1106201656,1107477094,1108757770,1110046899,1111345364,1112655232,1113976140,1115308497,1116650608,1118001050,1119357188,1120716070,1122074922,1123430062,1124779451,1126119750,1127450336,1128769061,1130076970,1131373431,1132660993,1133940331,1135215053,
 1136486611,1137759063,1139033996,1140315258,1141603910,1142902971,1144212377,1145533830,1146865764,1148208293,1149558421,1150914734,1152273453,1153632161,1154987336,1156336345,1157676899,1159007000,1160326138,1161633531,1162930480,1164217519,1165497362,1166771573,
 1168043644,1169315625,1170591098,1171871936,1173161172,1174459816,1175769843,1177090820,1178423369,1179765329,1181116012,1182471747,1183830910,1185189157,1186544584,1187893322,1189233936,1190563986,1191883071,1193190594,1194487446,1195774704,1197054439,1198328865,
 1199600809,1200872933,1202148229,1203429129,1204718131,1206016839,1207326569,1208647713,1209979873,1211322163,1212672340,1214028565,1215387153,1216745996,1218100880,1219450210,1220790379,1222120938,1223439696,1224747643,1226044253,1227331881,1228611384,1229886141,
 1231157801,1232430222,1233705176,1234986346,1236274984,1237573924,1238883349,1240204669,1241536690,1242879055,1244229331,1245585447,1246944370,1248302892,1249658288,1251007121,1252347845,1253677778,1254997039,1256304305,1257601376,1258888333,1260168307,1261442437,
 1262714618,1263986464,1265261995,1266542631,1267831875,1269130303,1270440333,1271761175,1273093763,1274435745,1275786484,1277142385,1278501556,1279860052,1281215405,1282564402,1283904848,1285235097,1286553933,1287861586,1289158160,1290445532,1291725004,1292999573, //2040
 1294271289,1295543600,1296818711,1298099839,1299388672,1300687611,1301997158,1303318498,1304650472,1305992933,1307342988,1308699354,1310057912,1311416803,1312771724,1314120978,1315461217,1316791596,1318110421,1319418120,1320714789,1322002161,1323281750,1324556302,
 1325828111,1327100406,1328375574,1329656672,1330945550,1332244401,1333554041,1334875189,1336207373,1337549478,1338899896,1340255753,1341614840,1342973183,1344328731,1345677491,1347018331,1348348296,1349667637,1350974977,1352272062,1353559046,1354838957,1356113047,
 1357385124,1358656898,1359932329,1361212903,1362502070,1363800471,1365110419,1366431270,1367763727,1369105752,1370456293,1371812306,1373171274,1374530011,1375885250,1377234591,1378575015,1379905620,1381224467,1382532412,1383828954,1385116507,1386395846,1387670478,
 1388941955,1390214250,1391489061,1392770152,1394058699,1395357637,1396666988,1397988407,1399320332,1400662917,1402013044,1403369472,1404728159,1406087006,1407442120,1408791284,1410131795,1411462076,1412781201,1414088782,1415385723,1416672922,1417952716,1419227020,
 1420498955,1421770937,1423046182,1424326946,1425615906,1426914462,1428224241,1429545176,1430877575,1432219564,1433570226,1434926039,1436285290,1437643613,1438999186,1440347955,1441688733,1443018781,1444338044,1445645556,1446942596,1448229836,1449509739,1450784112,
 1452056165,1453328159,1454603470,1455884143,1457173072,1458471477,1459781102,1461101940,1462434046,1463776115,1465126340,1466482485,1467841223,1469200128,1470555206,1471904678,1473245003,1474575710,1475894550,1477202619,1478499255,1479786982,1481066484,1482341315,
 1483612949,1484885404,1486160288,1487441429,1488729924,1490028766,1491337968,1492659158,1493990918,1495333201,1496683259,1498039416,1499398236,1500756936,1502112360,1503461460,1504802297,1506132492,1507451869,1508759320,1510056448,1511343503,1512623469,1513897641,
 1515169770,1516441634,1517717084,1518997717,1520286854,1521585237,1522895123,1524215854,1525548277,1526890090,1528240705,1529596443,1530955616,1532314025,1533669539,1535018558,1536359293,1537689646,1539008811,1540316572,1541613418,1542900818,1544180457,1545454944,
 1546726731,1547998881,1549274011,1550554945,1551843784,1553142525,1554452071,1555773216,1557105167,1558447437,1559797433,1561153648,1562512138,1563870987,1565225884,1566575249,1567915541,1569246166,1570565110,1571873121,1573169914,1574457567,1575737208,1577011939,
 1578283682,1579556038,1580831035,1582112114,1583400770,1584699584,1586009001,1587330141,1588662127,1590004260,1591354499,1592710391,1594069323,1595427694,1596783160,1598131971,1599472849,1600802921,1602122419,1603429921,1604727231,1606014390,1607294518,1608568733, //2050
 1609840943,1611112738,1612388178,1613668658,1614957734,1616255962,1617565792,1618886450,1620218838,1621560696,1622911254,1624267131,1625626179,1626984789,1628340122,1629689361,1631029891,1632360454,1633679440,1634987418,1636284141,1637571783,1638851331,1640126060,
 1641397725,1642670066,1643944990,1645226031,1646514585,1647813379,1649122651,1650443890,1651775701,1653118153,1654468181,1655824586,1657183212,1658542145,1659897208,1661246503,1662586942,1663917356,1665236403,1666544125,1667841006,1669128374,1670408144,1671682647,
 1672954581,1674226768,1675501997,1676782928,1678071812,1679370458,1680680084,1682001030,1683333229,1684675188,1686025673,1687381463,1688740643,1690098988,1691454615,1692803430,1694144334,1695474394,1696793781,1698101250,1699398385,1700685543,1701965528,1703239812,
 1704511953,1705783876,1707059292,1708339911,1709628948,1710927285,1712237000,1713557722,1714889887,1716231796,1717582065,1718938048,1720296844,1721655655,1723010835,1724360324,1725700791,1727031588,1728350550,1729658709,1730955395,1732243151,1733522623,1734797416,
 1736068972,1737341359,1738616167,1739897257,1741185705,1742484537,1743793713,1745114931,1746446650,1747788991,1749138972,1750495212,1751853933,1753212742,1754568082,1755917333,1757258152,1758588546,1759907962,1761215619,1762512784,1763799990,1765079928,1766354157,
 1767626160,1768897996,1770173249,1771453818,1772742748,1774041086,1775350820,1776671548,1778003898,1779345738,1780696360,1782052115,1783411362,1784769756,1786125385,1787474366,1788815260,1790145593,1791464967,1792772743,1794069821,1795357236,1796637076,1797911520,
 1799183425,1800455431,1801730573,1803011266,1804300042,1805598498,1806907979,1808228873,1809560821,1810902936,1812253001,1813609168,1814967768,1816326665,1817681658,1819031125,1820371468,1821702221,1823021193,1824329364,1825626191,1826914026,1828193702,1829468596,
 1830740336,1832012786,1833287693,1834568763,1835857216,1837155926,1838465062,1839786077,1841117783,1842459869,1843809908,1845165869,1846524716,1847883254,1849238740,1850587751,1851928705,1853258931,1854578497,1855886090,1857183451,1858470672,1859750850,1861025125,
 1862297377,1863569219,1864844663,1866125139,1867414150,1868712282,1870021973,1871342441,1872674664,1874016300,1875366762,1876722464,1878081556,1879440082,1880795590,1882144838,1883485621,1884816240,1886135464,1887443474,1888740366,1890027983,1891307643,1892582305,
 1893854058,1895126315,1896401318,1897682263,1898970872,1900269539,1901578810,1902899869,1904231594,1905573838,1906923721,1908279967,1909638464,1910997374,1912352377,1913701801,1915042266,1916372921,1917692039,1919000034,1920296961,1921584547,1922864282,1924138916, //2060
 1925410735,1926682986,1927958052,1929239020,1930527729,1931826406,1933135852,1934456821,1935788818,1937130766,1938481028,1939836765,1941195756,1942554052,1943909601,1945258418,1946599383,1947929515,1949249077,1950556665,1951854023,1953141282,1954421453,1955695762,
 1956967993,1958239843,1959515253,1960795728,1962084714,1963382882,1964692557,1966013110,1967345276,1968687018,1970037318,1971393116,1972751937,1974110563,1975465768,1976815131,1978155657,1979486428,1980805505,1982113734,1983410584,1984698461,1985978101,1987252994,
 1988524666,1989797071,1991071903,1992352912,1993641296,1994939985,1996249048,1997570133,1998901732,2000244011,2001593888,2002950150,2004308761,2005667636,2007022840,2008372164,2009712845,2011043328,2012362647,2013670433,2014967559,2016254937,2017534879,2018809302,
 2020081311,2021353318,2022628524,2023909195,2025197997,2026496354,2027805895,2029126587,2030458745,2031800541,2033151043,2034506777,2035866013,2037224399,2038580096,2039929037,2041270018,2042600260,2043919714,2045227373,2046524534,2047811842,2049091793,2050366164,
 2051638209,2052910169,2054185456,2055466093,2056754984,2058053329,2059362872,2060683590,2062015561,2063357480,2064707568,2066063588,2067422248,2068781103,2070136195,2071485720,2072826154,2074156995,2075475993,2076784220,2078080994,2079368834,2080648411,2081923285,
 2083194925,2084467365,2085742199,2087023282,2088311685,2089610429,2090919503,2092240556,2093572159,2094914287,2096264192,2097620225,2098978953,2100337618,2101693056,2103042251,2104383240,2105713662,2107033291,2108341024,2109638395,2110925656,2112205749,2113479973,
 2114752064,2116023815,2117299079,2118579482,2119868351,2121166459,2122476077,2123796558,2125128772,2126470417,2127820921,2129176603,2130535790,2131894280,2133249947,2134599177,2135940179,2137270822,2138590298,2139898349,2141195468,2142483079,2143762878,2145037429,
 2146309208,2147581241,2148856184,2150136846,2151425377,2152723783,2154033025,2155353906,2156685678,2158027844,2159377817,2160734071,2162092656,2163451645,2164806712,2166156279,2167496794,2168827651,2170146828,2171455062,2172752048,2174039864,2175319614,2176594405,
 2177866142,2179138432,2180413293,2181694186,2182982597,2184281149,2185590283,2186911169,2188242927,2189584907,2190935044,2192290924,2193649903,2195008388,2196364006,2197713003,2199054082,2200384359,2201704065,2203011776,2204309294,2205596664,2206876986,2208151370,
 2209423698,2210695547,2211970955,2213251320,2214540191,2215838141,2217147633,2218467918,2219799934,2221141445,2222491728,2223847403,2225206372,2226564988,2227920444,2229269876,2230610676,2231941538,2233260850,2234569150,2235866181,2237154104,2238433893,2239708808, //2070
 2240980603,2242252993,2243527898,2244808829,2246097203,2247395730,2248704684,2250025542,2251356962,2252699028,2254048727,2255404899,2256763416,2258122384,2259477598,2260827163,2262167925,2263498715,2264818127,2266126201,2267423371,2268710973,2269990896,2271265483,
 2272537427,2273809559,2275084670,2276365436,2277654106,2278952514,2280261872,2281582550,2282914473,2284256189,2285606447,2286962079,2288321161,2289679500,2291035211,2292384201,2293725360,2295055722,2296375449,2297683243,2298980682,2300268078,2301548240,2302822613,
 2304094783,2305366671,2306642017,2307922538,2309211455,2310509653,2311819208,2313139746,2314471720,2315813422,2317163492,2318519274,2319877904,2321236567,2322591667,2323941128,2325281651,2326612572,2327931731,2329240137,2330537100,2331825142,2333104878,2334379896,
 2335651618,2336924103,2338198931,2339479977,2340768312,2342066986,2343375963,2344696958,2346028445,2347370554,2348720316,2350076363,2351434915,2352793600,2354148850,2355498090,2356838953,2358169484,2359489091,2360797005,2362094439,2363381929,2364662121,2365936571,
 2367208728,2368480647,2369755892,2371036377,2372325138,2373623252,2374932717,2376253162,2377585238,2378926833,2380277259,2381632883,2382992066,2384350467,2385706160,2387055252,2388396294,2389726788,2391046345,2392354295,2393651555,2394939130,2396219126,2397493683,
 2398765682,2400037719,2401312852,2402593464,2403882114,2405180390,2406489680,2407810376,2409142162,2410484148,2411834133,2413190266,2414548884,2415907841,2417262934,2418612522,2419953002,2421283875,2422602954,2423911201,2425208071,2426495924,2427775591,2429050464,
 2430322170,2431594585,2432869447,2434150476,2435438871,2436737527,2438046585,2439367527,2440699145,2442041162,2443391135,2444747070,2446105915,2447464494,2448820053,2450169172,2451510252,2452840614,2454160309,2455468024,2456765479,2458052785,2459333010,2460607313,
 2461879551,2463151347,2464426705,2465707070,2466995938,2468293914,2469603431,2470923717,2472255762,2473597226,2474947550,2476303141,2477662193,2479020722,2480376314,2481725699,2483066684,2484397536,2485717026,2487025295,2488322429,2489610238,2490890032,2492164743,
 2493436476,2494708621,2495983457,2497264169,2498552525,2499850907,2501159910,2502480701,2503812204,2505154259,2506504022,2507860226,2509218771,2510577820,2511933029,2513282730,2514623485,2515954458,2517273873,2518582146,2519879294,2521167048,2522446870,2523721509,
 2524993245,2526265327,2527540146,2528820813,2530109178,2531407516,2532716631,2534037329,2535369108,2536710935,2538061136,2539416915,2540776008,2542134482,2543490257,2544839348,2546180618,2547511056,2548830931,2550138791,2551436389,2552723821,2554004102,2555278440, //2080
 2556550632,2557822377,2559097627,2560377898,2561666634,2562964527,2564273905,2565594164,2566926068,2568267589,2569617742,2570973456,2572332284,2573690962,2575046295,2576395817,2577736549,2579067542,2580386865,2581695345,2582992439,2584280546,2585560380,2586835424,
 2588107190,2589379621,2590654406,2591935295,2593223483,2594521911,2595830663,2597151397,2598482652,2599824600,2601174204,2602530272,2603888781,2605247658,2606602955,2607952483,2609293430,2610624253,2611943925,2613252079,2614549530,2615837202,2617117369,2618391956,
 2619664046,2620936056,2622211178,2623491690,2624780249,2626078307,2627387493,2628707804,2630039572,2631381007,2632731195,2634086710,2635445826,2636804222,2638160047,2639509232,2640850547,2642181176,2643501046,2644809098,2646106620,2647394215,2648674387,2649948880,
 2651220980,2652492894,2653768077,2655048523,2656337182,2657635247,2658944506,2660264939,2661596655,2662938344,2664288244,2665644114,2667002689,2668361514,2669716661,2671066306,2672406941,2673738027,2675057314,2676365836,2677662893,2678950982,2680230752,2681505757,
 2682777459,2684049899,2685324673,2686605655,2687893910,2689192494,2690501379,2691822250,2693153663,2694495621,2695845358,2697201253,2698559863,2699918451,2701273849,2702623068,2703964130,2705294693,2706614509,2707922493,2709220139,2710507716,2711788107,2713062608,
 2714334904,2715606781,2716882069,2718162405,2719451117,2720749001,2722058341,2723378516,2724710419,2726051764,2727402004,2728757462,2730116490,2731474866,2732830492,2734179739,2735520832,2736851619,2738171310,2739479615,2740777028,2742064939,2743345039,2744619847,
 2745891841,2747164001,2748438997,2749719606,2751008005,2752306187,2753615157,2754935715,2756267170,2757609028,2758958758,2760314847,2761673367,2763032384,2764387548,2765737269,2767077949,2768408989,2769728339,2771036743,2772333880,2773621839,2774901709,2776176600,
 2777448404,2778720727,2779995576,2781276411,2782564711,2783863113,2785172056,2786492743,2787824293,2789166102,2790516091,2791871894,2793230847,2794589384,2795945106,2797294263,2798635527,2799965989,2801285870,2802593715,2803891332,2805178755,2806459093,2807733464,
 2809005763,2810277585,2811552968,2812833322,2814122169,2815420090,2816729515,2818049704,2819381601,2820722972,2822073122,2823428673,2824787559,2826146114,2827501572,2828851040,2830191932,2831522911,2832842371,2834150815,2835447981,2836736010,2838015870,2839290818,
 2840562614,2841834973,2843109828,2844390688,2845678983,2846977412,2848286265,2849606997,2850938296,2852280221,2853629791,2854985852,2856344289,2857703226,2859058461,2860408128,2861749045,2863080060,2864399719,2865708058,2867005456,2868293249,2869573284,2870847914, //2090
 2872119811,2873391824,2874666743,2875947275,2877235674,2878533813,2879842903,2881163353,2882495080,2883836660,2885186824,2886542438,2887901549,2889259992,2890615865,2891965077,2893306502,2894637153,2895957182,2897265252,2898562939,2899850520,2901130808,2902405215,
 2903677344,2904949089,2906224226,2907504457,2908793055,2910090917,2911400172,2912720461,2914052274,2915393891,2916743962,2918099802,2919458554,2920817366,2922172659,2923522321,2924863071,2926194213,2927513599,2928822208,2930119351,2931407534,2932687363,2933962419,
 2935234122,2936506525,2937781214,2939062069,2940350164,2941648577,2942957274,2944278015,2945609279,2946951228,2948300895,2949656930,2951015539,2952374348,2953729764,2955079211,2956420284,2957751041,2959070862,2960379003,2961676648,2962964360,2964244739,2965519352,
 2966791601,2968063546,2969338725,2970619064,2971907588,2973205401,2974514503,2975834559,2977166246,2978507483,2979857620,2981213047,2982572144,2983930569,2985286401,2986635724,2987977068,2989307902,2990627823,2991936119,2993233707,2994521561,2995801790,2997076508,
 2998348608,2999620653,3000895730,3002176189,3003464626,3004762606,3006071559,3007391864,3008723260,3010064859,3011414529,3012770441,3014128966,3015487965,3016843226,3018193089,3019533915,3020865177,3022184656,3023493274,3024790465,3026078570,3027358403,3028633360,
 3029905064,3031177401,3032452119,3033732948,3035021098,3036319486,3037628252,3038948911,3040280247,3041622022,3042971773,3044327559,3045686305,3047044879,3048400513,3049749804,3051091128,3052421795,3053741830,3055049888,3056347661,3057635239,3058915659,3060190084,
 3061462363,3062734144,3064009429,3065289689,3066578409,3067876216,3069185524,3070505590,3071837402,3073178632,3074528734,3075884115,3077242996,3078601372,3079956886,3081306240,3082647284,3083978263,3085297967,3086606500,3087903945,3089192076,3090472178,3091747158,
 3093019099,3094291370,3095566252,3096846916,3098135153,3099433339,3100742109,3102062618,3103393845,3104735609,3106085116,3107441092,3108799454,3110158372,3111513505,3112863214,3114204035,3115535167,3116854790,3118163328,3119460754,3120748801,3122028888,3123303763,
 3124575671,3125847853,3127122685,3128403273,3129691472,3130989577,3132298400,3133618792,3134950258,3136291814,3137641781,3138997413,3140356416,3141714891,3143070728,3144419941,3145761366,3147091980,3148412048,3149720090,3151017874,3152305472,3153585912,3154860376,
 3156132673,3157404470,3158679733,3159959953,3161248589,3162546338,3163855545,3165175629,3166507373,3167848754,3169198804,3170554449,3171913261,3173271954,3174627363,3175976976,3177317836,3178648946,3179968390,3181276960,3182574123,3183862271,3185142125,3186417171 //2100
];

const S_TERM_NAME = ['小寒','大寒','立春','雨水','惊蛰','春分','清明','谷雨','立夏','小满','芒种','夏至','小暑','大暑','立秋','处暑','白露','秋分','寒露','霜降','立冬','小雪','大雪','冬至'];

// index: 寅月=0, 卯月=1, ..., 丑月=11
// solar term index: 立春=2, 惊蛰=4, 清明=6, 立夏=8, 芒种=10, 小暑=12,
//   立秋=14, 白露=16, 寒露=18, 立冬=20, 大雪=22, 小寒=0
const MONTH_TERM = [2,4,6,8,10,12,14,16,18,20,22,0]; // 寅月=立春(2) ... 丑月=小寒(0)


// ============ 年柱 ============
const WU_HU_DUN = { '甲':'丙','己':'丙','乙':'戊','庚':'戊','丙':'庚','辛':'庚','丁':'壬','壬':'壬','戊':'甲','癸':'甲' };
const WU_SHU_DUN = { '甲':'甲','己':'甲','乙':'丙','庚':'丙','丙':'戊','辛':'戊','丁':'庚','壬':'庚','戊':'壬','癸':'壬' };
const SHI_SHEN_SHORT = {
  '比肩':'比','劫财':'劫','食神':'食','伤官':'伤',
  '偏印':'枭','正印':'印','偏财':'才','正财':'财',
  '七杀':'杀','正官':'官',
  '枭神':'枭'
};

const ZHI_WX = { '子':'水','丑':'土','寅':'木','卯':'木','辰':'土','巳':'火','午':'火','未':'土','申':'金','酉':'金','戌':'土','亥':'水' };
const ZHI_MAIN = { '子':'癸','丑':'己','寅':'甲','卯':'乙','辰':'戊','巳':'丙','午':'丁','未':'己','申':'庚','酉':'辛','戌':'戊','亥':'壬' };
const ARCH_KEY = 'bz_archives_v2';
const TRASH_KEY = 'bz_trash_v2';
const ARCH_KEY_OLD = 'paipan_archives';
const TRASH_KEY_OLD = 'paipan_trash';
const ARCH_BACKUP_KEY = 'bz_archives_v1_backup';
const PRIVACY_KEY = 'bz_privacy_mode';

  // ===== 挂载到全局命名空间 =====
  window.CONST = {
    LOC_DATA: LOC_DATA,
    TG: TG,
    DZ: DZ,
    WU_XING: WU_XING,
    WX_CSS: WX_CSS,
    GONGWEI_MAP: GONGWEI_MAP,
    GW_INDEX: GW_INDEX,
    GONGWEI_COLORS: GONGWEI_COLORS,
    GONGWEI_COLOR_KEYS: GONGWEI_COLOR_KEYS,
    LUNAR_INFO: LUNAR_INFO,
    LUNAR_NEW_YEAR: LUNAR_NEW_YEAR,
    LUNAR_MONTH_OPTIONS: LUNAR_MONTH_OPTIONS,
    NAYIN: NAYIN,
    CANG_GAN: CANG_GAN,
    ZHI_TWIN_MAIN: ZHI_TWIN_MAIN,
    ZHI_TWIN_CANG: ZHI_TWIN_CANG,
    twinPillars: twinPillars,
    CS12_MAP: CS12_MAP,
    CS12_N: CS12_N,
    NAYIN_WX_YANG: NAYIN_WX_YANG,
    KONG_WANG: KONG_WANG,
    SOLAR_TERMS: SOLAR_TERMS,
    S_TERM_NAME: S_TERM_NAME,
    MONTH_TERM: MONTH_TERM,
    WU_HU_DUN: WU_HU_DUN,
    WU_SHU_DUN: WU_SHU_DUN,
    SHI_SHEN_SHORT: SHI_SHEN_SHORT,
    ZHI_WX: ZHI_WX,
    ZHI_MAIN: ZHI_MAIN,
    ARCH_KEY: ARCH_KEY,
    TRASH_KEY: TRASH_KEY,
    ARCH_KEY_OLD: ARCH_KEY_OLD,
    TRASH_KEY_OLD: TRASH_KEY_OLD,
    ARCH_BACKUP_KEY: ARCH_BACKUP_KEY,
    PRIVACY_KEY: PRIVACY_KEY,
  };
})();
